{
  "slug": "culver-diana-aiken",
  "name": "Diana Louise (Aiken) Culver",
  "extractedAt": "2026-01-16T03:05:00.000Z",
  "images": [],
  "immediateFamily": {
    "daughterOf": "Hiram Aikens and Louisa Heath",
    "wifeOf": "George Nelson Culver",
    "motherOf": "Otis Henry Culver, Fred Nelson Culver, Emma Louise Culver, and Inez Adel Culver"
  },
  "keyDates": "1836: June 29: Birth of Diana Louisa Aiken, Barnard, Vermont\n\n1850 (Age 14): Diana living with her parents in Barnard, Vermont.\n\n1862 (Age 26): Married George Nelson Culver\n\n1862 (Age 26): November 1: Birth of Otis Henry Culver (Gaysville, Vermont)\n\n1864 (Age 28): Birth of Inez Adel Culver\n\n1866 (Age 30): September 1: Birth of Fred Nelson Culver (Gaysville, Vermont)\n\n1870 (Age 34): Diana and George Nelson Culver were living in Stockbridge, Windsor, Vermont and Nelson was a grocery keeper.\n\n1872 (Age 36): October 2: Birth of Emma Louise Culver (Gaysville, Vermont)\n\n1880 (Age 44): Diana L. and George Nelson Culver were living in Des Moines, Polk, Iowa and George was a bookkeeper.\n\n1900 (Age 54): Diana L. and George Nelson Culver were living on Orcas Island, WA and George Nelson was a farmer. Diana had four children, and three were living.\n\n1910 (Age 64): Diana L. and George Nelson Culver were living on Orcas Island, WA and George Nelson was a farmer.\n\n1918 (Age 81): Diana's husband, George Nelson Culver died (January 13, 1918) in Friday Harbor, Washington at age 82.\n\n1920 (Age 83): Diana L. was a widow, living in Friday Harbor, WA with her son Otis's family.\n\n1920 (Age 83): Died January 14, Friday Harbor, Washington.",
  "about": "Diana Aiken Culver\n\nBiographical Notes by David M. Hall: January 2020\n\nIn January 2018, I wrote a tribute to my great-great grandfather Nelson Culver, on the centenary of his passing in 1918.  Two years later, on January 14, 1920, his widow, Diana Louise Aiken Culver, died at her son's home in Friday Harbor, WA on San Juan Island.  This is what I know of her story.\n\nMy great-great grandmother was born Diana Louisa Aiken, on June 29, 1836 in Barnard, Vermont, the first child of Hiram Aiken and Louisa Heath.  Diana had two younger sisters: Mary, born in 1840, and Agnes, born in 1850.  Hiram was a farmer.  Louisa died in 1852.  Hiram remarried in 1853, but died in 1856.  In 1850, Diana was enumerated along with three children from Hiram's stepmother's family.  They may have been boarders, or relatives who were being raised by the Aikens.  Many of the Aikens, including Diana, were members of the Universalist Church.\n\nOn November 28, 1861, 25 year-old Diana married 26 year-old George Nelson Culver.  Mr. Culver was from Pomfret, a small town about 7 miles from Barnard.  We don't know how they met.  The ceremony was performed at the home of Diana's parents.  There is a tintype photo of the couple that appears to be a wedding portrait.  The Culvers made their home in Gaysville, a village 10 miles from Barnard.\n\nAlso in 1861, the Civil War had started. Nelson was excused from service due to a crippled leg from an old injury.  But he wanted to support the cause, and paid a fee for a \"replacement\" soldier.\n\nFour children were born to Nelson and Diana.  Otis, my great grandfather, was born in 1862.  Inez was born in 1864, and died at the age of 2.  Fred was born in 1866, and Emma Louise (Lou) in 1872.  There is a photo of the three siblings, taken around 1882.\n\nAt some point while they were living in Gaysville, Diana had a long and serious illness.  While confined to her bed, she taught herself to draw pastels, and did a great deal of china painting - cups, saucers, plates and pitchers.  She sometimes entered her work in county fairs, and won many awards.\n\nIn 1882, the family moved to Jamestown, Dakota Territory.  Jamestown is about halfway between Fargo and Bismarck.  In 1880, the population was only 393, but grew to about 2,300 in the ensuing 10 years, after incorporating in 1883.  Nelson Culver was Secretary of the North Dakota Loan & Trust Co., and was also involved in city planning.  Son Otis, who went by \"O.H.\" rejoined the family after graduating from the University of Minnesota, and was hired as Principal of the Jamestown High School.\n\nIn 1884, when Diana was 48, the family uprooted again.  In his own words, Nelson was \"lured by the cry of gold to the wilds of the Coeur d'Alene region of  Idaho.\"  They lived for five years in Murray, Idaho which was a mining boomtown. Another resident of Murray in 1884 was Wyatt Earp.  Nelson and Diana were also hopeful that the mountain air would help their children's respiratory problems.\n\nIn 1889, the family moved to Spokane, where both sons went into the newspaper business.  In 1893, Nelson and Diana traveled to Orcas Island to find land for a new home.  They bought a partially-developed farm from Peter Schollander.  By early 1895, they had cleared and prepared the farm to the extent that they were able to move in.  They named the farm Alderbrook, for the row of alders that bordered the stream.\n\nShortly after moving to their new home, when the old house burned to the ground in a matter of minutes.  They lost everything, except furniture from one room.  There was no insurance.  Diana's sisters, Mary and Agnes, who never married, lived nearby, and one of them had discovered the fire.\n\nPerhaps by the end of the year, Nelson and Diana were able to move into their fine new home, which is still in the family.  They were in their early 60's.  The farm grew apples and plums.  They also raised sheep, pigs, and chickens, and had a vegetable garden.  Their daughter Lou, in her early 20's,  lived with them when not attending school to become a teacher.  Diana's sisters lived up the hill on their own little farm.  O.H. had married Mabel Smith, of Gaysville, VT.  He and Fred bought a weekly newspaper, the Islander, in Friday Harbor on San Juan Island.  Diana and Nelson's first grandchild, Evelyn, was born in 1895.  Some of what we know about the Culvers was passed down in the stories of their grandchildren, who cherished their visits to Alderbrook.\n\nIn June 1903, the Culvers hosted the wedding of their daughter to Mr. Cecil Willis.  We have a photo of the wedding party in front of the house.  Granddaughters Evelyn (6) and Leda (4) were flower girls.\n\nAlthough the house lacked such amenities as plumbing and electricity, high tech came to Alderbrook in June 1905, when a telephone was installed.  Everyone with a phone on that side of the island could listen to everyone else's phone calls.  By this time, health problems were developing.  Nelson leased out the farm for 1906, but he and Diana may have continued to live in the house.  In March 1911, their son Fred, whose health had never been good, went to Bellingham for a five-hour surgery which he knew he might not survive.  He died two days after surgery, at age 44.  Nelson had been recruited to go to Friday Harbor and run the newspaper, and wrote Fred's obituary in Fred's own paper.  Diana and Nelson were both ill, and unable to attend the funeral.  Nelson continued to run the Islander for a few more months.  In November, Diana's older sister, Mary, died unexpectedly at age 71, leaving only Agnes.  This prompted a move to Friday Harbor, to live with Otis and Mabel.  In August, Diana's youngest sister, Agnes, died at age 64.\n\nIn 1914, now in their late 70's, Diana and Nelson were back on Orcas at Alderbrook.  On April 4, Diana fell and broke her left hip.  She and Nelson then moved in permanently with Otis and Mabel and their five grandchildren.  Diana never recovered her mobility, requiring assistance to get up or down, or walk.  Nelson was attentive to her every need, and Evelyn then 19,  recalled that \"he downright flirted\" with his wife, who, Evelyn wrote, was a \"most patient, good-humored and appreciative person.\"  Diana stayed busy with reading, sewing, and writing long letters to friends and relatives.\n\nIn January, 1918, Nelson Culver died of a stroke.  Diana died two years later, on January 14th, 1920, at age 83.  They are buried in the family plot at the Olga cemetery on Orcas Island.\n\nFrom the small town of Barnard Vermont, about seven miles from Pomfret.\n\nCollege educated.\n\nTalented artist.\n\nAs a young woman, she had suffered from a long illness."
}
