{
  "slug": "culver-george-nelson",
  "displayName": "George Nelson Culver",
  "sourceUrl": "https://sites.google.com/view/orcashistoryresearch/people/culver-george-nelson",

  "connectionToPtLawrence": "Nelson began buying property on the east end of Orcas Island, between Doe Bay and Point Lawrence, around 1890-1892. There, on a rocky knoll, he built what he intended to be his final home, a Victorian house he called 'Alderbrook.'",

  "family": {
    "parents": "Joseph and Hannah Culver",
    "spouses": "Diana (Aiken) Culver",
    "children": "Otis Henry \"O.H.\" Culver (b. 1862), Fred Culver (b. 1866), Emma Louise \"Lou\" Culver (b. 1872)",
    "siblings": "He was the 3rd of 8 children"
  },

  "keyDates": "1835-1918 (82 years old)",

  "timeline": [
    {"year": 1835, "age": 0, "event": "Born September 6, 1835 in Pomfret, Vermont"},
    {"year": 1861, "age": 26, "event": "November 28: Married Diana Louisa Aiken at her parents' home. Civil War started; Nelson excused from service due to crippled leg from old injury, but paid for a 'replacement' soldier"},
    {"year": 1862, "age": 27, "event": "Otis Henry Culver born in Gaysville, Vermont"},
    {"year": 1864, "age": 29, "event": "Inez born (died age 2)"},
    {"year": 1866, "age": 31, "event": "Fred Culver born in Gaysville, Vermont"},
    {"year": 1870, "age": 35, "event": "Living in Stockbridge, Vermont; occupation: grocery keeper"},
    {"year": 1872, "age": 37, "event": "Emma Louise Culver born in Gaysville, Vermont"},
    {"year": 1876, "age": 41, "event": "Family moved to Des Moines, Iowa; built home at 1708 Woodland Ave"},
    {"year": 1880, "age": 45, "event": "Living in Des Moines; occupation: bookkeeper"},
    {"year": 1882, "age": 47, "event": "Family moved to Jamestown, Dakota Territory. Nelson was Secretary of North Dakota Loan & Trust Co., involved in city planning"},
    {"year": 1884, "age": 49, "event": "Family moved to Murray, Idaho mining boomtown. Nelson had a 'mercantile business'"},
    {"year": 1889, "age": 54, "event": "June: Entire Culver clan moved to Spokane"},
    {"year": 1890, "age": 55, "event": "August: Family moved to Fairhaven (now Bellingham). Nelson began buying property on east end of Orcas Island"},
    {"year": 1892, "age": 57, "event": "Built Victorian home 'Alderbrook' on Orcas Island between Doe Bay and Point Lawrence"},
    {"year": 1896, "age": 61, "event": "Sons O.H. and Fred bought the Islander newspaper in Friday Harbor"},
    {"year": 1902, "age": 67, "event": "June: Hosted wedding of daughter Emma Louise to Cecil Willis at Alderbrook"},
    {"year": 1905, "age": 70, "event": "June: Telephone installed at Alderbrook. Nelson sold advertising and wrote column for Islander"},
    {"year": 1911, "age": 76, "event": "Son Fred died after surgery at age 44. Nelson wrote Fred's obituary in the Islander"},
    {"year": 1914, "age": 79, "event": "Diana broke her hip; moved in with O.H. and Mabel in Friday Harbor. Nelson continued running farm but later suffered leg injury"},
    {"year": 1918, "age": 82, "event": "January 13: Died of a stroke at O.H.'s home in Friday Harbor. Buried at Olga cemetery on Orcas Island"}
  ],

  "biography": "Biographical Notes by David M. Hall (January 2018)\n\nOne hundred years ago today, January 13, 1918, my great-great grandfather, 82 year-old George Nelson Culver, died of a stroke at the Friday Harbor home of his son, O.H. Culver, where he had resided with his wife, Diana, for several years. This is what I know of his story:\n\nGeorge Nelson Culver was born September 6, 1835 in Pomfret, Vermont, near Woodstock. He was the third of 8 children of Joseph and Hannah Culver. Very little is known about his younger years. He received some schooling - several essays and poems written in his fine hand are dated from when he was 13 years old. We don't know what sort of work he first did, or whether he received any military training.\n\nOn November 28, 1861, George Nelson married Diana Louisa Aiken. Miss Aiken was from Barnard, Vermont, a village about 7 miles from Pomfret. The ceremony was performed at the home of the bride's parents. There is a small tintype photo that appears to be a wedding picture.\n\nThe Civil War had just started. Family legend has it that Nelson was excused from service because of a leg injury from a fall while barn-raising. He wanted to support the cause, and paid a fee for a \"replacement\" soldier to serve in his stead. What this means is that a man, usually someone with no money, would go off to war, while Nelson stayed home. At some point, Nelson's substitute was killed.\n\nThe couple made their home in Gaysville, Vermont, a small village near Woodstock on the White River. According to census records, Nelson was a grocery keeper. Four children were born: Otis Henry, my great grandfather, in 1862; Inez, in 1864, who died at the age of 2; Fred, in 1866; and Emma Louise (Lou) in 1872.\n\nIn the early 1870's, Diana's sister Mary had moved to Iowa, and later she was joined by sister Agnes. In 1876, the Culvers moved to Des Moines, and built a home at 1708 Woodland Ave. Nelson worked as a bookkeeper.\n\nIn 1882, the family moved to Jamestown in the Dakota Territory. Jamestown was an up-and-coming prairie town about half-way between Fargo and Bismarck, and had just been incorporated. Nelson was Secretary of the North Dakota Loan & Trust Co., and was also involved in city planning.\n\nIn 1884, in his own words, Nelson was \"lured by the cry of gold to the wilds of the Coeur d'Alene region of Idaho.\" The Coeur d'Alene was a mining boomtown. Nelson and Diana moved to Murray, Idaho, hoping that the mountain air would be beneficial to son Fred, age 17, whose health was poor. I don't know if there was any success at mining. Nelson had a \"mercantile business\" and O.H. started a newspaper. Another resident of Murray in 1884 was Wyatt Earp.\n\nIn June, 1889, the entire Culver clan moved to Spokane. According to oral family history, the move was financed by the sale of some of Diana's art. O.H., age 26, and Fred, age 22, established a printing and publication shop. Within a year, the building burned. The family moved to the Puget Sound region - briefly to Tacoma, and then in August 1890 to Fairhaven (now Bellingham). O.H. became manager of the Bellingham Herald, and Nelson began buying property on the east end of Orcas Island, between Doe Bay and Point Lawrence. There, on a rocky knoll, Nelson built what he intended to be his final home. He was about 56. According to one source, he designed the house himself. The style is Victorian, with gingerbread siding. Construction was completed by 1894. Nelson called it \"Alderbrook\" after the red alder trees that bordered a nearby brook. The house is still there and is known today as the Doe Bay Victorian Farmhouse.\n\nNelson and Diana raised fruits and vegetables, and kept some animals. Two of Diana's sisters had joined them from Iowa. In 1896, sons O.H. and Fred bought the Islander newspaper in Friday Harbor, and in June, 1902, the Culvers hosted the wedding of daughter Lou to Cecil Willis at Alderbrook. We have a photo of the wedding party and attending attendants in front of the house. Granddaughters Evelyn (6) and Leda (4) were flower girls.\n\nIn 1911, Fred became seriously ill, and was taken to Bellingham for surgery. O.H. accompanied him, and enlisted his father to run the newspaper for the week. Two days after a 5-hour surgery, Fred died at the age of 44. Nelson was left to write Fred's obituary in Fred's own newspaper, referring to himself only in the third person. He used the title of a hymn, \"Ring the Bell Softly, There's Crepe on the Door.\"\n\nAs to politics and religion, the Culvers were Republicans. O.H. displayed photos of Lincoln, McKinley, and Teddy Roosevelt in his office. Most of the family were \"New England Universalists\". Vermont was a \"dry\" state, and they did not drink.\n\nAround perhaps 1914, Diana suffered a broken hip, and moved in with O.H. and Mabel, and their five children, in Friday Harbor. At first, Nelson continued to run the farm. But he suffered another leg injury when the horses bolted, and he was either dragged or fell from a cart. Nelson joined Diana in Friday Harbor, and the farm was leased out.\n\nOn January 13, 1918, George Nelson Culver died of a stroke. He is buried at the Olga cemetery on Orcas Island.",

  "miscellaneous": "Photo reference: 0414. Politics: Republican (displayed photos of Lincoln, McKinley, Teddy Roosevelt). Religion: New England Universalist. Vermont was a 'dry' state and they did not drink. Designed his own Victorian home 'Alderbrook' (now known as Doe Bay Victorian Farmhouse).",

  "researchQuestions": [],

  "extractedAt": "2026-01-14"
}
