{
  "slug": "culver-otis-henry-o-h",
  "name": "Otis Henry \"O.H.\" Culver",
  "extractedAt": "2026-01-15T20:25:00.000Z",
  "images": [],
  "photoNumber": "0013",
  "connectionToPtLawrence": "TBD",
  "immediateFamily": {
    "sonOf": "George Nelson Culver and Diana Louise Aikens",
    "husbandOf": "Mabel Gertrude Smith",
    "fatherOf": "Evelyn Louise Culver, Leda Gertrude Culver, Mabel Florian Culver, Mary Luella Culver, Carroll Nelson Culver",
    "brotherOf": "Fred Nelson Culver, Emma Louise Culver, Inez Adel Culver"
  },
  "keyDates": "1862-1941 (d. Age 79)\n\n1862: November 1: Born in Gaysville, Vermont.\n\n1870: Otis was seven and living with his parents in Stockbridge, Vermont.\n\n1876 (Age 14): Moved to Iowa with his parents.\n\n1880: Otis H. was 17 and living with his parents in Des Moines.\n\n1884-1889 (Ages 22-27): Lived in northern Idaho. Worked at a newspaper during this time.\n\n1890 (Age 28): Arrived in Tacoma, Washington in June 1890. In August located in Fairhaven, WA. Stockholder and Manager of the Bellingham Herald for two years. Succeeded William Lightfoot Visscher as editor at the Fairhaven Herald (and later, The Weekly World). \n\n1894: September 6: Married Mabel Gertrude Smith in Gaysville, Vermont.\n\n1897: Started with U.S. customs, stationed initially in Roche Harbor.\n\n1898: Established U.S. customs port at Friday Harbor. Bought and published the San Juan Islander newspaper. Broher Fred continued to manage the paper. It ceased publication in 1914.\n\n1910: Otis and Mabel were living in San Juan and Otis was a customs collector.\n\n1920: Otis and Mabel were living in Friday Harbor and Otis was working in a U.S. government customs office. Otis's mother lived with them.\n\n1930: Otis and Mabel were living in Bellingham and Otis was working in a customs office.\n\n1941 (Age 79): November 15: Died (Bellingham, WA). Buried in Olga Cemetary on Orcas Island.",
  "about": "History of Whatcom County, Volume II, by Lottie Roeder Roth, 1926\n\nSource: http://wagenweb.org/whatcom/bios/bios10.htm\n\nO. H. Culver, United States customs commissioner at Bellingham, has long been identified with this branch of government service and has also achieved prominence in other walks of life. A native of Vermont, he was born in 1862, and when fourteen years of age he went to Iowa with his parents, George Nelson and Diana L. (Akins) Culver, who later migrated to North Dakota. There the father became secretary of a bank and also did surveying. Attracted by the cry of gold he joined the rush to the Coeur d'Alene region of Idaho in 1884, and for five years the family lived in that section of the country. In 1889 they came to Spokane and in the spring of 1890 arrived in Tacoma, Washington. By August of that year they were in Fairhaven, where the father became an extensive holder of real estate and also acquired an interest in the San Juan Islander, owned by his son Fred. O. H. Culver attended high school in Dakota, later continuing his education in the University of Minnesota. For several years thereafter he was employed on newspapers in northern Idaho and in 1890 became identified with the Bellingham Herald, of which he was manager for two years. Mr. Culver became connected with the United States customs department in 1897 and for three years was in charge of the port at Roche Harbor. He then returned to Bellingham and after a brief connection with journalistic interest reentered the customs service. He established the port at Friday Harbor, where he was stationed until October 7, 1920, and he has since been at the head of the department in Bellingham. He has a comprehensive knowledge of this branch of federal service and is one of the most efficient and trustworthy of the Washington body of government officials.\n\nIn 1894 Mr. Culver was married to Miss Mabel G. Smith, also a native of Vermont, and five children were born to them: Evelyn, now Mrs. Russell Watson, of Milwaukee, Wisconsin; Leda, the wife of George Hipkoe, a reporter on the Bellingham American; Carroll, who is taking a course in the University of Washington; and Mary and Florian, both of whom are attending high school. Mr. Culver belongs to the Elks and his wife holds membership in the Order of the Eastern Star. The political allegiance of Mr. Culver is given to the republican party and the religious faith of the family is that of the Universalist church. He and his wife are most hospitable, and their charming home on Eldridge avenue is a center of gracious hospitality. Their circle of friends is almost co-extensive with the acquaintanceship and all who know them have for them admiration and respect.\n\nSmith Family of Gaysville, VT\n\n1894 Otis Henry Culver, b. Nov. 1, 1862, Gaysville, Vt.; graduated from high school in Jamestown, N. D.; was one year in the University of Minnesota; was a newspaper worker in Idaho, in Bellingham and Friday Harbor. He resides at the latter place, where he owns and publishes a county newspaper. Children: 1. Evelyn Louise, 10 b. in Whatcom, Wash., Nov. 11, 1895. 2. Leda Gertrude, b. in \"Whatcom, Wash., Sept. 11, 1897. 3. Carroll Nelson, b. in Friday Harbor, Wash., April 7, 1904.\n\nWritten before Mary and Florian were born:\n\nMabel Gertrude, b. Oct. 5, 1872; m. in Gaysville, Vt., Sept. 6, 1894, to Otis Henry Culver, eldest child of George Nelson and Diana Louise (Aiken) Culver, who was born in Gaysville, Vt.,\n\nIn the News\n\n1908 (Annual Report, United States Civil Service Commission): \"Friday Harbor, Wash. — Case of O. H. Culver. In July, 1908, the commission investigated a complaint of alleged political activity on the part of O. H. Culver, deputy collector of customs at Friday Harbor, Wash. The investigation showed that Mr. Culver was a member and secretary of his Republican county committee; that he participated in the meetings of said committee; that he was precinct committeeman; that he circulated nominating petitions for Delegate Coman at the last State convention, and that he made some strong remarks against the Democratic party. His course was regarded by the commission as in violation of the civil-service law and rules. He was required to resign his membership in his county and precinct committees and give assurance that he would not participate in like political work in the future.\" \n\n1922 (Bellingham Herald): CUSTOMS OFFICERS GET RID OF 500 QUARTS OF RYE There's wailing and weeping and gnashing of teeth around the customs house today. Strong men wander about in the halls, whif-whiffing, but in vain; while there emanates from the office of Deputy Collector of Customs O.H. Culver the tell-tale gurgle, gurgle, gurgling of vanishing liquor. Is it a funeral anthem? No say customs officials, but just the bitter end of about 500 quarts of good old bonded whisky that has never reached the destination for which it was created. For several months, says Deputy Culver, prohibition agents have confiscated small batches of contraband liquor from auto-ists and others in the vicinity of Bellingham. This has been held in the custom house until now, when C.W. Kline, Federal agent of Seattle, in the presence of Deputies Culver and J.H. King, poured it all into the sink. One of the remarkable things about the matter is that Deputy King, upon whom devolves the task of uncorking each and every bottle, falls to the task without a whimper, although for the nostrils of a prohibitionist the smalls around-about are something awful. It is said to have affected flies and other flying insects in extraordinary manner—they fly around the custom house a few minutes on two or three wings and then drop.\n\nFairhaven Herald\n\nThe Fairhaven Herald was a daily newspaper published in Fairhaven, Washington from August 20, 1890 until the end of 1893. The Fairhaven Herald is an important resource for tracking the growth of the community's infrastructure, economy, and society, as well as reporting on community events and property transactions. Most issues feature news of Fairhaven property transfers and new business endeavors, proclaimed to prospective investors as proof that there is \"Nothing Flat About It\" and \"a Saloon on Every Corner,\" although by 1893 the newspaper's calls for \"enterprising men\" are interspersed with growing numbers of advertisements for businesses offering \"reductions\" or \"closing out\" sales.\n\nIn August 1891, the Fairhaven Land Company agreed to allow Otis Henry Culver and Elmer George Earle, local owners of The Weekly World, to consolidate management of both papers. This and Visscher's retirement were announced in the September 1, 1891 issue, with Culver placed in charge of \"editorial and business departments.\" Although initial news reports about this consolidation indicated that the two newspapers would merge into one, they continued to operate in tandem until the end of 1893, when dwindling finances finally forced suspension of the daily Fairhaven Herald in favor of the weekly publication, retitled The Weekly World-Herald. A renewed interest in a daily Fairhaven newspaper led to the revival of a brief-lived Morning Herald and The Evening Herald in 1900. The enterprise continued until May 17, 1903, when it was purchased by The American Reveille to become The Bellingham Herald."
}
