{
  "slug": "culver-george-nelson",
  "name": "George Nelson Culver",
  "extractedAt": "2026-01-16T03:15:00.000Z",
  "images": [],
  "photoNumber": "0414",
  "immediateFamily": {
    "parents": "Joseph and Hannah Culver",
    "siblings": "He was the 3rd of 8 children",
    "marriedTo": "Diana (Aiken) Culver",
    "fatherOf": "Otis Henry \"O.H.\" Culver (b. 1862), Fred Culver (b. 1866), Emma Louise \"Lou\" Culver (b. 1872)."
  },
  "keyDates": "1835-1918 (82 years old)\n\n1835: Born September 6, 1835 in Pomfret, Vermont\n\n1862, age 27: Otis Henry Culver born\n\n1866, age 31: Fred Culver born\n\n1872, age 37: Emma Louise Culver born\n\n1918: Died January 13, 1918 in Friday Harbor, Washington",
  "about": "George Nelson Culver\n\nBiographical Notes by David M. Hall (January 2018)\n\nOne hundred years ago today, January 13, 1918, my great-great grandfather, 82 year-old George Nelson Culver, died of a stroke at the Friday Harbor home of his son, O.H. Culver, where he had resided with his wife, Diana, for several years.\n\nI have been a frequent visitor to the Orcas Island home of G.N. and Diana Culver throughout my life, and have inherited much of what we know about the Culvers. Some of the lore is anecdotal, passed down through oral tradition. Other bits come from letters, photos, and newspaper articles, as well as census records and newspaper archives.\n\nGeorge Nelson Culver was born September 6, 1835 in Pomfret, Vermont. His family called him \"Nelson\". He was the third of eight children of Joseph and Hannah Culver. We know little of his youth. In one document, possibly an obituary, he was referred to as a \"scholar\". He broke his leg at some point, which would leave him with a permanent limp. The Civil War began in 1861 when Nelson was 25. He was excused from service because of his bum leg, but to support the cause, he paid a fee for a \"replacement\" soldier.\n\nOn November 28, 1861 (which would have been Thanksgiving Day, except that wasn't a thing yet), 26 year-old Nelson married 25 year-old Diana Aiken, who was from the small town of Barnard VT, about seven miles from Pomfret. Diana was college educated, and was a talented artist. As a young woman, she had suffered from a large tumor, which was surgically removed by a doctor, assisted by students from Dartmouth College, on the kitchen table in her parents' Barnard home.\n\nNelson and Diana established their home in Gaysville, another tiny town about 10 miles NE of Barnard. They had three children. The oldest, Otis Henry (my great-grandfather) was born November 1, 1862. He was followed by his brother Fred in 1866, and sister Emma Louise (Lou) in 1872. The Culvers' neighbors included Dr. Charles Carroll Smith and his wife Mary, whose daughter Mabel (born in 1872) would one day become Mrs. Otis Culver.\n\nIn 1876, the nation's Centennial, the family traveled to Iowa, first to Des Moines, and then to Jamestown, Dakota Territory (now North Dakota). Nelson got a job as secretary of a bank, and also did surveying. Son O.H. graduated from high school, and enrolled at the University of Minnesota. In 1884, when Nelson was 48, he was \"lured by the cry of gold to the wilds of the Coeur d'Alene region of Idaho.\" The family moved to the mining boomtown of Murray, Idaho, where they lived for the next five years, tending a general store and hotel. Nelson and Diana were also hopeful that the mountain air would be beneficial to their children, who had respiratory problems. Another resident of Murray in 1884 was Wyatt Earp. Today, Murray is a tiny, unincorporated mountain village, about 55 miles east of Coeur d'Alene.\n\nIn June, 1889, the entire Culver clan moved to Spokane. According to oral family history, the move was financed by the sale of some of Diana's art. O.H., age 26, and Fred, age 22, established a printing and publication shop. Within a year, the building burned. The family moved to the Puget Sound region - briefly to Tacoma, and then in August 1890 to Fairhaven (now Bellingham). O.H. became manager of the Bellingham Herald, and Nelson began buying property on the east end of Orcas Island, between Doe Bay and Point Lawrence. There, on a rocky knoll, Nelson built what he intended to be his final home. He was about 56. According to one source, he designed the house himself. The style is Victorian, with gingerbread siding. Construction was done by Nelson and O.H., and hired workers who were paid one dollar per day. We don't know when the house was completed, but by 1893 it could be described as \"partially developed.\"\n\nThe Culvers called their farmstead \"Alderbrook\", for the row of large alder trees along the creek that marked the southern boundary. The farmhouse had neither electricity nor plumbing. Fresh water was pumped by hand from a well, located on the opposite side of the house from the two-seater outhouse. The outhouse was not used at night. There were chamber pots.\n\nThe acreage was used primarily for apple orchards. This was before Eastern Washington began extensively growing apples. Most of the surviving trees were removed due to an unfortunate miscommunication decades ago. One of the four remaining apple trees still bears fruit. It is a red gravenstein, and is perhaps 125 years old. The apples make wonderful pies and applesauce. The farm also raised sheep. There was at least one cow, and two horses, whose names were Kit and Homer. There was a chicken coop which was still barely standing in the early 1960's. The large barn in the lower field blew down in the 1962 Columbus Day storm. The woodshed, across from the kitchen door, is now in danger of collapse.\n\nWhile Nelson and Diana had everything they needed to be self-sufficient, the farm was not always profitable. There were difficulties in getting fruit to market over rocky roads or by water. For much of their residency, the farm was leased to tenant farmers. Nelson was often absent from the 1895 farm because of commitments in other San Juan County communities. His sons owned newspapers in Friday Harbor and Bellingham, and Nelson often assisted them. In 1903, daughter Lou married neighbor Cecil Willis in a ceremony in the Alderbrook yard. Photos of the wedding show a house seemingly in disrepair.\n\nThings then took a turn for the worse. Shortly after completing all of the construction, the original farmhouse - a simple cabin that had been on the property when the Culvers acquired it - caught fire and burned to the ground. Nelson and Diana lost almost everything, with the exception of the furniture in one bedroom. There was no insurance.\n\nIn 1911, Fred became seriously ill, and was taken to Bellingham for surgery. O.H. accompanied him, and enlisted his father to run the newspaper for the week. Two days after a 5-hour surgery, Fred died at the age of 44. Nelson was left to write Fred's obituary in Fred's own newspaper, referring to himself only in the third person. He used the title of a hymn, \"Ring the Bell Softly, There's Crepe on the Door.\"\n\nAs to politics and religion, the Culvers were Republicans. O.H. displayed photos of Lincoln, McKinley, and Teddy Roosevelt in his office. Most of the family were \"New England Universalists\". Vermont was a \"dry\" state, and they did not drink.\n\nAround perhaps 1914, Diana suffered a broken hip, and moved in with O.H. and Mabel, and their five children, in Friday Harbor. At first, Nelson continued to run the farm. But he suffered another leg injury when the horses bolted, and he was either dragged, or fell into the farm machinery the horses were hauling. He too then moved to Friday Harbor, deeply frustrated that he could no longer care for himself. Three years later, Nelson died of a stroke. He and Diana are buried at the Olga cemetery on Orcas Island.\n\nThe Alderbrook home was rented out to a series of tenant farmers for the next 15 or 20 years, but was not used as a permanent residence again. And while plaster has cracked, and the foundation has settled, it is otherwise little changed. There still is no electricity or plumbing. Some of the furnishings are original. To visit is like stepping back in time. One notable addition was the painting of a large mural that takes up one wall of the dining room. The mural was done in the 1940's by a young art student, David Ireland, who went on to become a famous artist in San Francisco.\n\nI often think of Nelson and Diana when I am in their home. I am sure they would be thrilled to know that their many descendants still enjoy visiting, and amazed that their great-great-great grandchildren can still pick apples from one of the trees.\n\nSources include: G.N. Culver's obituary, articles in the San Juan Islander, U.S. Census, Evelyn Culver Watson's written memories, written notes by Carroll Culver, photographs, and oral history."
}
