{
  "slug": "culver-ken",
  "name": "Kenneth Louis Culver",
  "extractedAt": "2026-01-15T20:00:00.000Z",
  "images": [
    "https://lh3.googleusercontent.com/sitesv/AAzXCkfm0pG2oExWCqTv8nrzdt0_4DdjngeOhzUCtc87RBtAIFVyUXtz7xxvt42H4USuMjY-z5dpWqUzMtzJNNwNfDwuZV61p-L7UXYUKxw7smDg2knR8NC-f_2H9IpRA33VSUUJgWalbbGbU8GOmVwzIfRullzoKsp77Xwf01uTiFiHrsaLOV6mfIZjFgWvQ4KMRJA7z7kv248MOt-ipH_FBUofveb1QWFjtK9TktE=w1280",
    "https://lh3.googleusercontent.com/sitesv/AAzXCkdTE2fw6vD32UQuGNMPMdsSml3eSpnVuE9ChaE6TzP32dqNsIYJlp5v1LRL8Iu-zCMCraROZsx06eclrYq8_w2gq0O7sJzVd4atjKMbsRDSEkkiRysTBAwMrR8968zsrsbkG6P70Z8nrWq8RAAvaT0ctnHVU6QvFPbIDW_qkXKcoanFWyqvgr7pQIKgd1blzrKCqgpetKkUhyPQYCZ5U33UhTX0Gtc02amheYA=w1280",
    "https://lh3.googleusercontent.com/sitesv/AAzXCkebOBtLzs8JWf7uWEz6W-3JibsqyUqKAs3klScuVDkd84CtgYjaXKyQVxdwUJkWjOKqImk88GnjIzzgLRQP9ufnt5d5R9CwDt-Q6bcWROwGtuZf1W920ugsfPc9w-jelOqQ4yVHaVFHHyiomjKpmE_W2JVyyevoI995WRVkrQB-7tlZxz-pGPeauZQ9sbfOyPNquU5vLdR2F4s_RgGS5Zkh5eprwYs3_gz3AWY=w1280",
    "https://lh3.googleusercontent.com/sitesv/AAzXCkeBam7S7Ml2gnIezOXtNOdf17GGcubPyw1c86Kb61Kbg_56nKyzEh_limzsvOwSVDJ_z4gpl5p4DsAK5f3OAS-wO0n2F2GNb1CFYIVl5pSMz2ilZHfMRwW_cH9wwyXo9Y_VWWjebqYGQHjXA5lEQd-K3Ah-DldTbfBBkBh0X2RmbABgS1ldcoZOzRgd392J-fo8zzVW1__H_F55uxt3dCf-4SX5BSrSq1Uu1S8=w1280",
    "https://lh3.googleusercontent.com/sitesv/AAzXCkcbjOGjMpgwPW2jAszNY3E9LqRipgxZWB0i8tLIggi--MLEoGsbIe4DGNB5XaxqDR2fpeU7TZxDvsol4XTqv1IHOIE4hCnazHuF50trQXXZNh1HK2lbAO2WW3f_MLYkKWQoJh3IjRbX2T7-NJjJoMhblG0RGGfqTIQLOexzRGBZzP40yrV--N1NNTJOobm5t0fBTzBE_iZG_i1cPfJH3GiDxDoda-Fb_lXPSCk=w1280",
    "https://lh3.googleusercontent.com/sitesv/AAzXCke-fd6jYiXBLod7QUlVBuSD_XrOAk58D3-cIqeIKwa99m8qaNLFqnxpUSZLtmFe0rxYjtaicYnC6DwTJLOJlnWrpmQpxim0iG_XQ95-oBucudLT35vU1qcHLmcJnfsWsmj8B3dW5mrGw7lEwiO7xxAKFoRXNvfMAAmWY20fwNmSvzwsQMEjO6W_OoDvQGlGPUDC997FDstL6MESkRgAhtq223oJ_GHhuuMw=w1280",
    "https://lh3.googleusercontent.com/sitesv/AAzXCkdVqCuhLXRt854MoQEE-m8y-S-aJVa-EVyqO5UzVDXFFO5g_Lvs8FdlG1YadHdmaiKEn36GBppzVxVvS5CcHRMTCRHnMhFH8wlgKx3mJbAWFFewYMejMZXTRq2KRtCqlGdvwL47AtbuICfAICyk0vdO9A2-ocpWOC9nBZGnh1AN3E5Kobh0-bOXESnU5EVXGjXjGJ90pgmg16C8JY_-0kOmPkRLP6xrsLzp=w1280",
    "https://lh3.googleusercontent.com/sitesv/AAzXCkebOBtLzs8JWf7uWEz6W-3JibsqyUqKAs3klScuVDkd84CtgYjaXKyQVxdwUJkWjOKqImk88GnjIzzgLRQP9ufnt5d5R9CwDt-Q6bcWROwGtuZf1W920ugsfPc9w-jelOqQ4yVHaVFHHyiomjKpmE_W2JVyyevoI995WRVkrQB-7tlZxz-pGPeauZQ9sbfOyPNquU5vLdR2F4s_RgGS5Zkh5eprwYs3_gz3AWY=w1280"
  ],
  "photoNumbers": ["0498", "0540", "0513", "0544"],
  "connectionToPtLawrence": "Ken Culver grew up at the Pt. Lawrence Lodge and purchased the property from his father, Carroll Culver, in the late 1960s.",
  "immediateFamily": {
    "sonOf": "Carroll Nelson Culver, Jean (Rothenhafer) Culver",
    "husbandOf": "Marcia (Barnes) Culver",
    "fatherOf": "Jeff Culver, Kathleen Culver",
    "brotherOf": "Bruce Culver, Carolyn (Culver) Leonhardt"
  },
  "about": "The Boats in My Life—and Other Ramblings\nKen Culver, December 23, 2024\n\nGrowing up at Point Lawrence Lodge clearly had a major impact on my lifelong love of the water and the boats of all types that plied the waters that surrounded me. As I think about it now, it also impacted life decisions about work, military service, play, and the various places I have lived throughout my life. \n\nOne of my first real jobs started when I was probably about 12 years old. I was paid by the hour (about 50 cents as I recall) to take resort customers out fishing, usually mooching for salmon with the fishing technique I learned from my father, using plug cut herring that was purchased in Anacortes from the Pacific American Fisheries (PAF). We bought them in 100 pound frozen blocks that we then had to cut up into chunks while they thawed (messy). My father put them in a brine solution overnight to toughen them up for trolling. Then one summer our neighbor Vic Hughes told us that when he was young, they would \"jig\" herring for bait for his families resort down at Doe Island. I had seen herring schools from time to time around Pt. Lawrence, at Kangaroo Pt. and off the point in front of the resort, so why not? My Dad made a herring jig by connecting several leaders of 6 inch 25 lb. test line to a central leader with tiny bare fish hooks (size 12 I believe.) There was a small lead sinker on the bottom. You dropped the array into a school of herring and just jiggled the rod up and down to make the hooks move and twinkle. During good tides, you could often get one on each hook – a sight to see as these were 8 to 12 inch long fish. Some customers came just to catch herring – forget about salmon. Norwegians and Swedes loved smoking them and pickling them.\n\nI had a large galvanized tub in the boat full of fresh salt water. You dropped the lead sinker into the tub and carefully turned each hook containing a herring upside down so they would drop in to the tub and begin swimming. I had a small bucket that had a screen over it and a rope to retrieve it that I used to bail out the stale water in the tub and refresh it with new salt water. If you did not do this the herring would use up the oxygen and start to die. I could probably put several dozen into that tub before running back to the resort to empty them into a large floating bait box that my father had built. I dumped them in, and quickly headed back for more before the tide changed. There was also a market for live herring to fish the waters of Pt. Lawrence. Jigging herring and keeping them alive to be sold was pretty lucrative. I got $1 dollar a dozen and during busy times would often sell many dozens each day. Herring jigging is regrettably a thing of the past, due to a combination of factors including large commercial herring barges from Seattle who used lights and seine nets at night to capture entire schools of herring. Another factor was the rise of a commercial fishery for herring roe – sold to the Japanese for premium prices. The roe were harvested from the kelp beds off many of the islands, most notably along the shores of Lummi Island and north to Point Whitehorn. In any event by 1960 the huge schools of large bait herring had all but disappeared, and jigging for them became fruitless. To my knowledge there were only a few places in the San Juans where jigging herring was possible. Kangaroo Point was without a doubt the best spot, followed by Patton's Point, Deer Point, and occasionally the North Beach at Olga where the Olga School was located. What follows are some stories and memories of the boats that I have owned or used in one way or another. Most I was able to find photographs of.\n\n14 foot \"Skiff\" 1947-1960\n\nThe skiff was an open 14 ft. flat bottom carvel planked wooden rowboat with oars. It was probably built by Reinell in nearby Bellingham. My first experience in a boat was probably as a small child sitting in the bow of this skiff while Mom rowed us around the quiet waters of our bay and past the rocky cliffs in front of Buck Horn. My first experience in the skiff alone I cannot even remember. There are photos of me rowing with Mom and earlier photos of my Dad in various boats and I am sure Dad was letting me row around by myself while still in grade school. Rowing with a single set of oars was a lifelong skill that eventually led to my being a part of the junior varsity crew at the University of Washington crew in 1958/59.\n\nBy the age of 10 my father OK'd the idea of attaching one of the resorts 2 ½ hp Lauson aircooled rental outboards to the transom of the 14 ft. skiff. Wow! The beginning of a new era for me. That little Lawson was almost prehistoric by todays standards. Rope start – you wound it around a little flywheel sticking out the top of the motor. It had a self contained gas tank which probably held a quart of gas. It had one sparkplug and would run all day on a single fillup. Great for the fishermen, but too weak to buck the big tides at Pt. Lawrence when they were running. My father kept a 5 hp Johnson outboard for personal use, but also for going down to Pt. Lawrence to tow back one or more fishermen with their little Lawson motors not able to get back home.\n\nThe Lauson motor had a primitive choke and an equally primitive little knob that controlled the speed once it got started. There was no neutral or reverse gear so I quickly learned to have the boat pointed where I wanted it before trying to start the motor. I recall it was slow to start, especially when it got wet from the spray. In the early days, probably the late 40's and early 50's, the resort did not have a telephone, and our only contact with the outside world was by boat. My dad put a 5 hp Johnson on the skiff and would take the trip to Olga to pick up our mail and purchase necessities. Eventually we got a 10 horse and I was allowed to make the trip to Olga by myself on calm days. As I got older I was making the trips to Olga regardless of the weather. Several trips I remember I got a little scared but I never capsized or swamped the boat. Once I got caught in a big swell at the Olga ferry dock while unloading provisions and the boat almost swamped.\n\n16 ft. Reinell Cedar Planked Rental Boat 1950\n\nBy the time I became aware, the resort had around a dozen 16 ft. Reinell cedar planked rental boats that were available to cabin and tent customers by the week. Cabin customers had preference. Many customers brought their own small outboards and the rest rented the Lauson outboards and then later 5 hp Johnson outboards which had a \"redi-pull\" self contained starting cord. This was a major advancement. With one person or two light kids that 5 horse could plane those 16 footers. We soon learned where the weight had to be to get them on plane – but man that was cool to see that flat water streaming out behind the outboard. We were flying!\n\nReinell Cedar Planked rental boats\n\n#0498. 18 ft. Reinell 1954 with early 10 hp Johnson outboard.\n\nThere was also a 16' wooden boat which I assume was also built by Reinell, although it was a slightly different hull design. What was interesting was that this was an inboard boat powered by a Wisconsin air cooled engine that sat uncovered in the middle of the boat with a little exhaust pipe that came out on one side through the hull so you could only walk around one side of the boat. This was also a rope started engine, just wrapped around a small flywheel. I got pretty good at starting it. It had a 2:1 reduction gear and was quite powerful but not fast. My job was to use that boat to tow the other boats to a mooring buoy or to the dock. I spent many hours in that boat doing that chore, and once in a while was allowed to use the boat to tow the floating dock from its winter sanctuary around Buck Horn to its summer position on our beach. By 1960 the outboards had gotten bigger and better and the inboard was seldom if ever used as I recall.\n\nOther Outboard Motors 1955-60\n\nAs I got older, outboard motors started to show up. I was fascinated to see what customers would bring to put on the rental boats. Lots of Johnsons, Evinrudes, Scott Atwaters, and a mysterious new name - Mercury. Horse powers were now going up, although most customers had 10 hp ones because of the weight and the need to fit them into the car trunk. There were no SUV's then. I quickly noticed that a 10 hp Mercury could outrun the rest of the outboard pack. My Dad ended up buying one and while I was in high school Dwight Reed and I built our own water skis by steam bending cedar boards and attaching basic rubber foot mounts and the 10 HP Merc could pull us. Then Dwight's Dad Harry Reed bought a 15 hp Evinrude and I learned about how horsepower ratings differ. The Merc 10 could outrun the Evinrude 15 but could not pull a skier out of a deep water start. That Evinrude could – and we went back to the drawing board and built single skis. We would start on 2 ski's and then drop one and single ski behind that Evinrude. No wetsuits yet so it was invigorating. There was also a Chris Craft boat that just appeared at the resort one day. I was told by Hank Blecken that his Dad Gus had bought it to do some commercial fishing. It was 16 ft. powered by a Chris Craft 6 cylinder marine engine, ran fast, and was set up as a troller. Gus was from Wisconsin and was famous for making all of his own spoons. It was a beautiful wooden boat and I suspect was originally made for a gentleman runabout/cruiser – it even had a little cabin. On the downside, that engine was a gas hog, and at some point the decision was made to sell it. I got to ride with Gus a few times and had a chance to drive it – thrilling for a teenage kid.\n\n14' plywood Hydroplane (singlehull)\n\nMy senior year at Orcas High was the first of what was to become 10 years of living in Seattle. We lived on Capitol Hill where my Aunt Eloise had a basement apartment for rent, while Mom and Dad continued to run the resort. One summer, I noticed a small hydroplane boat sitting up on the shore by the old Hughes cabin down by Doe Island. I went ashore and asked Vic about it and he said \"take it – its yours.\" I towed that thing home and put the 10 hp merc on it and away I went. It was slow to get up on a plane but once up it just flew – but it was tender. I think that is why Vic's friend did not keep it. It would porpoise and the bow would lift out of the water if it caught a puff of wind. It liked going straight but did not like turning unless you slowed down and leaned to the inside corner of the turn.\n\nMy Mother made me wear a life jacket and it proved it's worth after a couple summers of romping around in that crazy thing. By then my Dad had purchased a Merc 20 horsepower so naturally I had to try that. On the very first run from the floats I headed for Kangaroo Pt. and it got up on plane and started accelerating much faster than I expected. The next second I just remember a sheet of water and the boat suddenly stopped and me clinging to the inside of the hull in about 4 feet of water. Apparently the boat porpoised and the bow dug in and it flipped end over end and came to rest right side up with me inside it. I was pretty shook up but I did not hit anything, and I was wearing my life jacket, and the boat stayed afloat. I got my breath back and crawled out onto the foredeck and started paddling towards shore and finally touched the bottom and stood up. The 20 horse Merc was sticking straight up, the prop completely out of the water and motor running! No kill switch in those days. The kill switch was a lanyard around your wrist that you pulled on to short the plug. No wrist, no pull! It had already been running for a while before I got to it and it was running hot. My Mother ran down to see if I was Ok and declared I would never run that boat again. I gingerly walked the boat back to shore, drained the water, and told Mom the motor was running hot and I wanted to run it back to the dock to cool it off before I shut the engine off. She relented and I ran it back to the dock. The hull was ok and later that summer I drove it up to Seattle on a borrowed trailer and sold it. With the money I bought a Merc 10HP \"Hurricane\"\n\n10' Outboard Racing Hydroplane 1957-58\n\nAs stated, my Aunt Eloise lived on Capitol Hill. Her house was one story in front and two stories in back. The main floor had Eloise's living quarters and the upper half of a large basement where she did her artwork. Below her art space, she had converted to a small apartment with it's own entrance. That's where I lived for my senior year and later while in college at the U of W. Across the street were a bunch of what are now called \"Row Houses\" – small homes built cheek to jowl. One family had a son about my age and he owned an outboard racing hydroplane. A \"BU\" I recall. These were really cool boats to my eye; small and very fast. I asked him about them and he said there was a fellow in Renton who made them for a good price. Bingo. That fall I took the bus from Capitol Hill to Renton, found the place, and ordered a boat. It was the first time that I designed what I wanted on a piece of paper, got an estimate, saved up the money I had earned from the resort over the summer, and actually handed over cash. The guy wanted cash. The boat was built in his garage. I did not have a car and could not afford a trailer, so I paid him extra to have the boat delivered to the back door of Eloise's basement. The big day arrived and with help we tried to get it out through the basement door. It was about an inch too wide no matter how hard and what angle we tried. So off came the gunnel trim and we eased it out onto the back lawn. I scoured up a used Mercury Hurricane 10 hp from a Seattle Times want ad and we launched the boat for the first time down at a little ramp by the Seattle Yacht Club in Portage Bay. Like all outboard hydroplanes you knelt on the floor with one hand on the steering wheel and the other on the crash throttle – a device that you had to hold on to or it would spring open and kill the engine. My mother now insisted that I have a crash vest rather than just a life jacket and I scrounged a used one up from one of the marine places along the lakefront since there was a lot of hydro activity at that time. It was the time of the Slo-Mo-Shun unlimited hydros, the Gold Cup races, and numerous other limited hydro races on Lake Washington, Green Lake, and the infamous Sammamish Slough where Dwight Reed and I would race his Dad's little 14' plywood outboard against other kids coming the other way – somehow the adults did not know about that activity. !\n\n14' Utility Runabout Ski Boat.\n1957-58\n\n#0540. Sitting on trailer at Grandmas Montlake house.\n\nThere was a fellow that helped out at the Willis Sawmill that had an interesting little plywood runabout sitting on a trailer complete with a 25 horse Evinrude outboard. I never saw it in the water and asked if I could buy it. He was thrilled to get it out of his little driveway and gave me a very generous price just to see it go I suspect. The boat was 14' long with a little windshield (nice) and a steering wheel and 2 seats with backs (nice also). It was fast, but not like the hydro, and rode fairly rough, but that 25 hp Evinrude was a beast. It could pull a single skier out of the water with 2 people in the boat, and it lived its life on Orcas for a couple of summers including my first summer after college when Dwight and I worked at Rosario at the gas dock. It had a light blue hull but I fear there are no photos. At some point I sold it – can't remember where or to who. The money was used to pursue my next boat.\n\n16' Drag Boat 1959-1960\n\nSome of my friends who were rowing crew at the U of W were also interested in boats. We made some trips to some hydroplane races, mostly at the Sammamish Slough. Once we went to one that was held in connection with Lake Sammamish. There was a fellow there with a boat I could not take my eyes off. I followed him to the launch ramp after the races. I had seen similar boats on Lake Washington called drag boats, only this was an outboard, made of plywood, and finished in varnished mahogany. Drag boats were built to get up on a plane fast, and then go faster. The owner/ builder was there and we started talking. He could build me a simple unfinished version of the boat for about the same money I got from selling the little blue boat. I would have to do all the rest and find an outboard. Deal done. He delivered the boat and I put it in my Grandmothers garage in the alley behind her house. That winter, while attending school, rowing crew, and generally have a great time enjoying fraternity life, I managed to finish that boat, find a used boat trailer, and a used Mercury 75, an amazing piece of engineering that was ahead of its time, but not popular. 6 cylinders in a stack. No gears. Direct Start. Unreliable. Fast.\n\nI cannot find a photograph of that boat but I recall it was just under 16 feet long, with narrow slab sides, a broad flat bottom and a fair bit of rocker as was typical of drag boats. I finished it out with varnished mahogany decks and sides and deep green paint on the bottom. It didn't have seats, just pads. I could sit in the stern with one hand on the steering wheel and the other on the throttle at cruising speeds. The steering wheel was connected via cables to a steerable bracket that the Merc was attached to. This allowed the driver to sit way back where the weight was needed for planing. Think drag racing motorcycle! To get up on a plane I had to lie flat on the front deck – then roll back to the center – then slide back to the stern with the wheel. It was extremely tippy but would fly across the water if you could get it on a plane. It was loud!. It didn't like chop – on Lake Washington 6 inch chop I think the whole boat was out of the water and it was riding on the outboard cavitation plate alone. Scary. Exciting.\n\nLake Union Houseboat\n\nIn about my third year at the U of W I moved out of Grandma's house and decided I wanted to live on a houseboat. I had admired them when I rowed past on our daily crew workouts. I walked the docks down at Fairview Ave.East and found an end houseboat with police tape plastered all over the entrance and visible signs of a fire.\n\nI found the owner of the dock (a cool old woman that owned the headlands and a couple of the houseboats including this one.) There had been a gay man living in it and as the story goes he was murdered by a partner who then set the houseboat on fire. The Seattle police fireboat got there in time to save the structure but not the interior. I asked if there were plans to rebuild it and she said she did not have the money so it would probably be towed out and destroyed. Hmmmm. I asked her if she would be willing to rent it to me if I would fix it up, hoping my deal would prevail. It did. Over the remaining school year I rebuilt that houseboat and moved in before summer. It was really quite nice – I learned all kinds of skills – carpentry, electrical, plumbing, even built a fireplace. I bought used furniture and materials from a junk house in the University District, and a little 2 burner stove from a marine dealer also nearby. None of this was inspected or permitted – it was a houseboat! I even managed to find a roommate who turned out to be one of my insurance customers years later when I started in business. He had come to the U of W on a scholarship as a fullback from Indiana but had the misfortune to play at the same time as the famous U of W football star Junior Coffey was playing so he got little field time and ultimately flunked out. His real name was Maurice Bushatsky, a fine polish name if you lived in industrial Indiana, but not out in the West.\n\nI always liked it personally. He became my houseboat room mate. I charged him $30 a month so my rent was $20. My how things down at that dock have changed. Carolyn Culver (my sister) bought a houseboat on the same dock about 5 years ago for close to $1 million.\n\n18' Ski boat \"Circe\"1964\n#0513. Circe - Pt. Lawrence.\n\nAll of this is leading to my next boat. I took a summer job working as an accounting assistant for the Grandy Boat Company located on Lake Union on the West side almost directly across from the houseboat. Grandy Boats was a name I had grown up with – the Grandy Brothers were legendary wooden boat builders and total characters as well. My 6 months of part time accounting job there were an education. The company also had a service yard which included a bunch of derelict boats that various owners had abandoned or otherwise left. My job was to estimate the value of these boats, compare them to outstanding bills owed to the yard, and advise management on what they could do with them. One of the boats was an older Grandy Cruiser with a cracked block and a number of other issues. Probably a 30 footer that should have been re-powered and refinished – but the owner could not afford to. Another was a gorgeous 18' mahogany runabout (ala Chris Craft) sitting on a trailer that had been there for some time. I did not know the back story. It has a nice 350 horse Olds engine with dual 4 barrel carbs. In the middle of the yard was an ancient one car garage which had big folding doors that the owners said did not work. I told them I could fix them. They made me a deal to rent for $20 a month and in went the boat. I kept it there until I sold it to Pete Stiles just before I left for the Coast Guard Officer Candidate School in 1964.\n\nI cleaned it all up, painted the hull black, named it Circe (Black Witch) and waited for summer weather. That boat was a water skiing machine. It had a 350 horse Oldsmobile engine and a direct drive transmission. Neutral but no reverse. It could pull two skiers on singles on deep water starts with 4 or 5 people in the boat at the same time. If I was towing a single skier and hit the throttle hard that 4 barrel carburetor would just roar and the acceleration could cause a skier to spill forward. So much fun! I was able to moor it in the water next to my houseboat so life was crazy good. When possible I would haul it out to Lake Sammamish to Gary Ostles lakefront home where Gary, Pete, Rod Newton, John Fromm, and other friends could ski to their hearts content.\n\n13' Boston Whaler (#1) 1969\n\nFast forward. Coast Guard Officer training at Yorktown Virginia, then my first CG assignment in Bellingham, followed by a year in Juneau, and finally 2 years on Biorka Island, a 3 acre island at the most westerly tip of Alaska's Alexander Archipelago where Marcia and I were newlyweds. After my discharge from the Coast Guard, we returned to Bellingham where we settled into a little starter house in Sunnyland, near Lake Padden. My father had kept his old 18 foot Reinell and it was now powered by a tired old Merc 200 (20HP) which was underpowered for that boat. After one frustrating use of that boat a decision was made. We need a boat! \n\nI had been totally impressed with the 13' Whalers that the Coast Guard had. We had one at Biorka Island in Alaska that was launched from a crane to go out into ocean swells to be loaded with 50 gallon drums of diesel to run our generators. The operator would then bring the heavily loaded boat along side the piling dock where the crane operator had lowered a pallet like structure into the water. As the swells rose and fell the Whaler operator would time them in such a way that the Whaler would slide unto the pallet and the crane operator would yank it out of the water. Mom and I actually got a chance to use that boat a couple of times when the summer weather was perfect and we actually caught some fish from it. \n\nWe took Dad's old Reinell and feeble Mercury and headed for Anacortes where we walked in and bought a 13 foot Whaler much like the one that Gary had. Open with 20 hp merc and tiller steering. I think the boat was around $1500 and the motor was extra – maybe another $800. We traded in the Reinell and the old 20 hp Merc and headed home. It was our first boat as a married couple. Our trips to Orcas became more frequent – usually crossing from Anacortes at Cap Sante Marina where we moored the boat during the week. Then one day we decided to head to Orcas with some friends in pretty windy weather. The chop was big and coming from the west. We went past Cypress, got pretty well beat up and finally pulled into a tiny anchorage at Strawberry Island where we anchored and waited for hours. Finally the weather let up and we held our course to Orcas. I had to slow down and just barely keep the boat on a plane and we ran across Rosario in the troughs. By then it was almost dark but the wind had pushed us west of Doe Island and we had taken a fair amount of spray. I got in as close to the kelp beds as possible and we slowly bashed our way to Kangaroo and into our bay. I could see the waves breaking on the beach where we normally would land. That was not going to work. I ran to the east end of the beach clear past the boathouse. The waves there were less. Now what? I had watched fishermen in Hawaiirun their boats at the beach at high speed, then kill the motor at the last moment and ride the ensueing frontal wave right up the beach. I lined the boat up about 200 feet off shore , hit the throttle, and headed for the beach. Just before the bow got to the beach I killed the motor and tilted it. The next thing I remember is that the boat was high and dry on the beach – the water had drained away and we stepped out of the boat – dry! What a great boat.\n\n17' Boston Whaler Montauk 1972\n\nI had been eying the new 17 foot Boston Whaler with a center console and decent size outboard motor. It had the DNA of the fishing boats that I had admired, and a walk around deck for fishing. That was the boat that I wanted. One day Mom and I drove to Anacortes and I traded in the 13' and bought a brand new 17' Whaler Montauk. I got a galvanized trailer and kept the boat in my back yard. That boat got plenty of use and kept getting improved. First a Bimini top, then a bow rail to keep the kids safe, and finally a 50 hp Merc. Each year we would haul out of Bellingham and take it to Orcas and back; going when the weather was right – usually early in the morning before things got stirred up. Then I decided on upgrading the outboard and building a new mahogany control station with a nice windshield. We put the 13' up for sale in the Orcas Island newspaper and a wealthy man from West Sound called and said he would buy it sight unseen. He came and got it and ran it home. We used the money to buy a new 80 HP Mercury outboard and we arranged for storage and launch at the little Fairhaven Marina owned and operated by Roger Bedell. I could call Roger and he would have the boat in the water and he would wait for us to return on Sunday evening before closing up. That lasted for a couple of years but Bellingham Bay waves and rainy trips were getting old. \n\n18' Thunderbird\n\nThen I saw a used 18' Thunderbird sitting in the yard at Yeagers, who sold boats in those days. The Thunderbird design was a Florida built tri hull with a deep center vee hull. It was an inboard outboard boat that despite their reputation served us well for many years. That hull was soft riding and had a nice convertible top and a marine head. We took it to Orcas many times, either launching in Anacortes or continuing to use Fairhaven. It could go fast enough to water ski, and young Jeff and his young friends did, pulled behind a 60' rope, bouncing over the wakes. We used this boat for many years, often camping in it at Sucia, or heading across to Orcas from Anacortes on a nice summer day.\n\n26' Sisu \"High Slack\"\n\nAbout this time I began noticing a different style of boat that I found very attractive; the lines derived from the Maine lobster boat. Maine Lobster boats are characterized by a high bow, elegant sheer, semi displacement hulls and as working boats, open cockpits and big gas or diesel inboard engines that could push them as fast as the displacement hull would allow. Yacht versions had lower stern profiles and could carry bigger engines that could push the boat unto a plane. One thing led to another and I began a search for a small lobster style hull that I could build out for our family use. I learned early on that these boats were primarily built in New England by small shops and individuals that could fabricate wood hulls in the classic lobster style hulls. Some were completely finished while others could be purchased in various stages of construction. One of the most famous designers of these boats was Royal Lowell and one company called SISU was producing Royal's designs in cored fiberglass rather than wood, which was still prevalent in New England Coast. They hold tight to tradition back there – to their credit.\n\nMarcia and I had made an earlier trip connected to a business conference in upstate New York and made a sweep through a number of lobster boat builders on the coast from Rhode Island up into Massachusetts but did not find the right boat. So I called Sisu and made arrangements to attend another insurance conference in New York – then flew to New Hampshire and stayed overnight with Peter Brown the general manager of Sisu. He had one of their 24 foot boats on a little lake near his home. After dinner we took it for a spin in the dark. The next day he took me to the plant, and a couple of boats under construction as well as the one I came to look at – a 26 footer with a soft top and a galley that could sleep 2 adults and 2 kids in a pinch. I liked it but it needed a lot of work to get the performance characteristics that I was looking for. We talked about that and he recommended I contact a fellow named Gary Osgood who built boats in nearby Portsmouth. Not surprisingly Gary was also building Royal Lowell designs. I went to Gary's shop and to my delight there sitting in his small shop was my boat. It was a Sisu 26 hull that Gary had purchased and then fitted out with a small custom cabin. The fellow who had ordered it could not afford to finish it. Gary walked me around it, explaining the hull, the engine (a Volvo diesel), and the soft top, along with his plan for finishing the interior. We agreed on a price and I headed home. The boat was delivered by truck to Squalicum Harbor that summer. My contractor clients built a nice teak interior and I spent the rest of the summer finishing the interior as well as building deck boxes and helm seating. We named it \"High Slack\" – the fisherman's term for the change of tide from flood to ebb, considered the best time to be fishing for salmon, at least at Pt. Lawrence.\n\nWe used that boat faithfully for several years until we took a trip with Bob Adams and family to Desolation Sound and got caught in a fierce wind and rain squall at anchor. Mom and I were in the vee births and Jeff and Kathleen were outside under that soft top sleeping on the side benches. Their sleeping bags got soaked and they were cold. That did it. The boat needed a hardtop. \n\nThat fall I sat at my drawing board making sketches based on a Wilbur 34 which I had long admired. I finally got the proportions right, turned them into scale drawings, and got in touch with a couple of insurance clients that did fiberglass fabrication. In the end I went with a small outfit called Padden Creek Marine made up of former Uniflite workers who were operating out of an old cannery down at the Colony Wharf boat haven. We got started in the winter and it was not finished until late spring the following year. I then started the final woodwork, interior, and electrical work, which was not completed until mid summer that year. In the middle of this a gillnetter in Anacortes had blown his diesel on the first day of the season in Bellingham Bay. The engine had a cracked intake manifold which flooded the engine. Chubb Insurance paid for a new engine and returned the original to the Seattle dealer. They went through the entire engine and essentially rebuilt it although there was no serious damage. The gillnetter didn't want to take a chance on missing his season so I was the lucky beneficiary of his error. The dealer sold me the engine at an insurance salvage price but with a new engine warranty and delivered it to Bellingham. \n\nWe relaunched the boat in June and continued its use until 2008. That little boat took us safely through rough weather, a grounding in the LaConner Slough with Howard and Margaret Barnes aboard, and a second grounding in Nanaimo with our family. \n\n13' Boston Whaler (#2)\n\nEach year at Jeff's birthday I would tell him that when he reached the age of 12 we would buy a 13' Whaler and keep it at Orcas. When age 12 finally arrived I started hunting around for a used one but they were hard to find. Finally in late spring, I went over to Hawley's boats and motors on Iowa St.just to see how much it would cost to buy a new one. I was quoted a price that was more than I wanted to pay. Then the salesman said – \"by the way we have a 1 year old used one that we took in trade if you want to look at it.\" It was essentially a brand new 13' Whaler super sport model with a 40 hp Johnson outboard and a galvanized trailer. The asking price was about 2/3's what a new one would cost. I said I would go home and think about it – in reality to check on finances. It took about 3 hours and by the time I got back the salesman said he had another interested buyer who was coming back with his wife. He then said \"if you are serious I will need a deposit to hold the boat. If the other guy's deal falls through I'll sell it to you.\" I made an offer considerably less than what was being asked and held my breath. He countered with something in between and I said deal. We shook on it and I wrote a check and headed home. Somewhere in the car on the way home I started laughing uncontrollably. When I composed myself Jeff asked why, and I said I got such a deal, and he said what difference does that make since we can afford it? Yes we can Jeff, and that is precisely why I was laughing. I told him about the first car I had ever purchased and how my Dad let me do all the negotiating and after a few trips the salesman caved in and Dad bought me the car at my price. I drove up that driveway so proud of my negotiating skills and the deal. And then Dad told me that the reason I got such a deal was because the seller was over a barrel – he desperately needed the cash. Then Dad said it would have been appropriate to offer more in a circumstance like that – a lesson I have not forgotten. Jeff did not understand my point, and I'm not sure I could have explained it anyway – he was only 12. On the way home I pulled into a Dairy Queen, which Marcia had suggested the night before – to celebrate if we bought the boat – but the truth is I don't think he cared – just wanted it gone. About halfway up the driveway I slowed down and gave out a big war hoop. We stole it Jeff! We stole it!\n\n35' Duffy: \"Northerly\"\n#0544\n\nAfter I retired I began to think about that Wilbur 34 I had always yearned for. For several years I would check Yacht World from time to time but never saw anything worth pursuing or I could afford. During the summer of 2008 I was again checking Yacht World and there appeared before me a new listing. A Duffy 35 that had the prettiest sheer and cabin profile I had ever seen. I called the broker in Maine who told me a lot about the boat. Designed by Spencer Lincoln for Duffy and initially built for commercial lobstermen, they had proven extremely popular. That led to some yachtsmen (usually former sailors) buying them and having custom interior work done by separate boatyards in the area. \n\nEnter Erich Kunzel – the long time conductor of the Cincinnati Pops orchestra, who had a summer home on one of the many offshore Maine islands. He commissioned a Duffy 35 for use as a runabout and tender to his island and had it fitted out by Calvin Beal – one of the premier wood workers in the Downeast region. Beal custom built a beautiful mahogany interior, complete with a forward cabin with vee berths, a U shaped galley like many sailboats. The head space was constructed to permit a full stand up shower. The cabin space allowed for the seating of 6 or more and the drop down table converted to a double berth, allowing the boat to sleep 4 comfortably. The raised panel teak paneling throughout the boat set it apart from any other Duffy I had seen, and the broker agreed it was the finest interior she had seen.\n\nIt was August and the broker said the owners needed to sell the boat and hoped to do so quickly before winter set in. On the spur of the moment Mom and I decided to fly back and see for ourselves and less than a week later we were in Portland Maine waiting to meet the broker and see the boat. We met for lunch in a small village that had a marina somewhere north of Portland and ate lobster rolls and discussed downeast boats. Annie Gray specialized in these and had been in the business for many years along with her husband – hence the name Gray and Gray. \n\nWe met the owners at the dock in Stonington – down a long peninsula with occasional views of the Atlantic and weathered lobster boats sitting on land waiting to be launched for the next season. Stonington was a working lobster town with a small but charming business district and a well used fishing pier with a large crane. The owners took us on a ride in their boat after we walked the docks and watched the lobster men at work – some unloading their catch – while others headed back out into the bay for more. We were taken with the traditional character of the boats and the men who operated them. These boats were serious fishing boats, most made of wood, with open cockpits and big diesels. The ride was exhilarating – Penobscot Bay in summer is a wonderful place to be – and the boat was everything we had hoped for. After the ride the owners arranged for us to have dinner that evening – a \"Saturday Night Fish Fry\" consisting of most of the locals – I saw no tourists. It reminded me of community pot lucks that our family attended at the Olga Community Hall. And the fish and lobster had been caught that day. \n\nI recently read an article in the New York Times that said that Stonington is considered to be the quintessential Maine town, but has now been discovered and they are having to deal with summer crowds and tour buses. Back then we had it to ourselves. The next night we ate a gourmet meal at a little waterfront restaurant about 100 yards from our room and watched lobstermen bringing in their catch. Back to Portland the next morning and home to Bellingham where we had arranged to pick up the Fleetwoods and spend a few days at Orcas. I had been going back and forth by phone with Annie and she encouraged me to make an offer or the boat would be gone. I made an offer that was decidedly less than the asking price. Annie said she did not think they would accept and she was right. They countered with something I could accept. I faxed her a copy of my Captains license and Coast Guard service and closed the deal. After we got home I put the little Sisu up for sale and made plans to retrieve the Duffy. Annie had arranged for the new owners to haul the boat out at the Stonington Marina and wait for a truck to take it across the country. I found a trucker who assured me that he had transported boats from New England before and was available to do it during the first week of November. Then I got a call from the owner of Stonington Marina demanding that I get this boat out of his yard or pay to store it for the winter. I got hold of the trucker and urged him to get going. Then I found out his partner had backed out and he did not have enough money to pay for the trip. So I agreed to wire $5000 to him so he could fuel up and get moving. He picked the boat up in Stonington, drove across the US and Canada, and every night and morning I got a call from a Shell truck stop giving me his progress – \"Hi Mr. Culver – I'm in Bozeman. Maybe get there tomorrow.\" He showed up Thursday night after they closed and every night and finally arrived on a Sunday morning at Colony Wharf expecting to be paid (cash). I explained it was Sunday and the banks were closed. Then it dawned on me that Monday was a bank holiday as well. The truck driver just shrugged and said can you recommend a couple of good places to eat? I think he may have been waiting for instructions for a new load so wasn't too stressed. It was one of those sleeper cabs so he just stayed and relaxed with his big black dog for company.\n\nThe boat was taken into one of the Colony Wharf buildings where over the winter months I spent many hours as various work was done. The bottom was scraped and sanded clean, as was the entire hull. A hole was cut through the transom to create a walk through to the swim platform. After the New Year Dave Brown primed and sprayed the hull with Awlgrip Flag Blue – just like the Hinckleys. \n\nIn the meantime I was busy sanding the teak decks, recoating the cabin tops with a gray non skid, removing the huge in line muffler and replacing it with a new custom water lift muffler and associated piping. Mike McPhail at Seaview Boatyard was the project coordinator and we had agreed on a number of projects that needed to be done by professionals. Midway through the project the engine was started and oil/water emulsion spewed out. Mike ran up and there on a table were the two heads of that Caterpillar 3208 covered in what looked like dirty cottage cheese to me. We went out to the boat and looked into the cylinders which were rusted and coated with the same cottage cheese. Mike said simply \"salt water incursion\" which must have happened during the loading or truck trip across country. I immediately contacted Mike McGlinn who I considered to be the most professional and most trustworthy local marine surveyor.\n\nHe came down right away and opened a claim report to my Insurance Company – the esteemed East Coast Chubb insurance- who was one of the only companies that understood what a Downeast Lobster Style boat was! Mike suggested we remove the large in line muffler that was visible behind the engine so I did and took it home to my workbench. I stared at that thing for a couple of days trying to understand the backflow prevention valve designed to keep sea water from backing up into the engine. The muffler had a decal stating it was manufactured by a company in Maine. I called and talked to the guy – and finally got him to agree that there was a problem with the valve because it could get stuck open if there was grit in the raw water. Then I called the marina in Stonington and he said he remembered starting the engine after it was taken out of the water and thought it ran a little rough. That was the answer. When the boat was hauled for loading they started the engine with the hose disconnected from the raw water inlet so the engine could suck the sea water out of the hull. The gritty sandy bottom water caused the flapper valve to not seat – a small dribble of sea water backed up through the exhaust manifolds into the engine. We have a claim! A few weeks later a nice lady from Chubb called and thanked me for the information – she was in the Chubb Subrogation Department. Subrogation Departments are a legal group that aims to recover claims paid out from the third party that was at fault. Consisting of both lawyers and investigators they are tenacious, so good luck to both the marina and the muffler man.\n\nMike worked up the cost based on rebuilding the old Caterpillar 3208 and reinstalling it. I was not thrilled with that idea, so he said let's look into new electronically controlled engines and immediately suggested his favorite which was the Cummins QSB common rail electronic diesel, a high tech new engine that was jointly engineered by Mercruiser and Cummins. No smoke! Quiet at low rpms, and highly efficient. Quick research showed that it would fit and provide more space in the engine compartment as it was a 6 cylinder in-line engine instead of a wide V8. The decision was made. Apply the insurance money, Mike would buy back the damaged Cat engine for parts, and I would pay the rest to get the new engine. Within hours Cummins NW in Seattle was contacted and in two weeks the new engine with marine transmission arrived. The work of installing everything began.\n\nA couple of weeks later Mike called and said \"can you come down to the boat? My first thought was it would not fit, or a big problem had arisen. When I got there he walked me out to where the boat was sitting on the trailer and I immediately saw water pouring out of the transom exhaust. The motor was running but I could not hear it from outside the boat. Hallelujah!!\n\nA couple of days later the boat, Mike, his electrician, and I stepped aboard at Weldcraft Marine by the Yacht Club, I hit the key and for the next hour or so we ran around at various speeds outside the breakwater. It was a little choppy from the south and Mike kept remarking about how there was no pounding. We all had ear protectors on as they had electronic equipment hooked up to the engine computer panel so the engine hatch was open and at full speed it was plenty loud! Mike gave me the thumbs up and we headed for the boathouse, which I had managed to purchase just a few months prior from Ralph Hager. Ralphs wife had been sick for years and he did not use his boat anymore. I had told Ralph way back that I would be interested in buying the boathouse if he ever wanted to sell. He had mentioned it to his insurance agent, Dan Reeder, who told me about it. A few months later he called and said he had decided to sell the boathouse. He indicated he was going to sell the boat and I asked about the boathouse. He said \"I need to talk to my kids about that but I will let you know.\" True to his word he called less than a week later and said he would sell. His price was firm – I knew Ralph well enough not to try and negotiate a better deal. It was a cash sale and we went together to the Auditors office with a bill of sale that we had hand written and signed between us. Ralph and I agreed to a fake low price to avoid sales tax. My kind of man! The clerk at the auditor's office looked at the bill of sale and said that was not acceptable. It had to be on some special form and come through a broker or bank. Ralph stood silently for a minute and slowly said in his best surgeon's voice \"young lady this transaction is completely legal and if necessary I will walk down the hall and speak to the County Executive who is a good personal friend\". Well- that must have sounded like the voice of God to her, and she processed our document. Welcome to Whatcom County."
}
