{
  "slug": "culver-mabel-gertrude-smith",
  "name": "Culver, Mabel Gertrude (Smith)",
  "extractedAt": "2026-01-15T20:20:00.000Z",
  "images": [],
  "immediateFamily": "TBD",
  "keyDates": "1872-1952\n\nBorn: Mabel Gertrude Smith in Gaysville, Vermont on October 5, 1872.\n\nMarried: Otis Henry Culver September 1894.\n\nDied: Bellingham, WA 1952. Graveside service at Olga Cemetary, October 21, 1952.",
  "about": "\"New England Girlhood\"\n\nMabel's New England girlhood story as she told it to her Church Circle in 1946 or '47 (she would have been ~74 years old). Some parts may seem vague or unfinished, as she wasn't there to explain her notes when they were first transcribed by Jerry Hall in 1948. The typed copy of this document was given to Carroll and Judy Culver at Christmas 1975.\n\nIt seemed as if my childhood and youth in a Vermont hamlet must be too uneventful to tell about—unless to my own children, those days of long ago when little girls wrote and figured upon slates, were taught to say \"yes ma'am\" and \"no ma'am\" to their elders and to make patchwork or sew carpet rags. Perhaps it was not as uneventful as I thought, but I did not know it then.\n\nThe nearest railroad was seven miles away, over a rough and hilly road, hardly any way of going unless someone's horse and wagon could be borrowed. Our people came from the south, mostly, some of them from Massachusetts, and very few strangers stopped there.\n\nNews of the world came from the weekly paper, read aloud evenings by the head of the family. Neighbors called once in a while for friendly conversations. Relatives assembled for Thanksgiving.\n\nTo those who think winter is all cold and darkness, let me quote from the description of a Vermont March—\"The crows have come from nobody knows where to herald the approach of spring. From maple to maple they hop and then with a defiant 'Caw' drop through the air to sit amid the swelling buds of the roadside elms. Soon boots worn by the men who collect the sap of the maple, and the oxen will break out the road into the sugar lot. Then the maple trees will be tapped, the spouts set, and the buckets hung. The dropping sap will make pleasant music, mingling with the cry of the blue jays and the complaining of the squirrels.\n\n\"After noon the gathering of the sap begins. The great fire roars in the arch. The sap dancing in the pan sends clouds of steam to the tree tops. The air will be filled with the incomparable flavor of new maple syrup in assurance that the earth is again pouring forth her first seasonal bounty. Those who once lived among these scenes of the awakening of nature cannot but find themselves awakened and transformed.\"\n\nThe whole school or perhaps the whole village would sometimes be invited to a \"sugaring off\"—One sugar place was in easy walking distance. Each person took a saucer and teaspoon—eating the sugar in all stages. There would be a bank of snow nearby and we would make a clean hard place and cool the sugar on this. At a real sugar party, pickles are served to \"cut the sweet.\" And usually there would be sour pickles in the lunch pails on our school days during this season.\n\nWinter was not all gloom. Soon we would be sitting on the front door step watching the first Robin and the ice would be breaking up and going out of the lake.\n\nSure, the snow and cold made more work, and the house must be made very tight for winter. Windows were banked up with leaves covered with boards or evergreen boughs. This must all be cleared away in Spring, so I think later, my father just threw a great deal of snow around the house each time it fell.\n\nThere were storm windows for the rooms used most, otherwise steam would form frost so thick we could not see out.\n\nOne January a house and a house and a large barn near us burned. Our buildings took fire, nearly everything was moved out of the house. My sister and I went to spend two or three nights with two \"maiden\" ladies—sisters down in the village.\n\nThe first morning, Julana, one of the sisters, sad that she had scratched the frost from a small place on the window pane and that our house was still there.\n\nIn our reading book we read \"Snow is the poor man's friend and the working man's helper.\" Work in woods was done in winter. It was much easier to get around on sleds and get in the supply of fuel.\n\nTeamsters with mufflers and caps drawn down over the ears, beards frosty, would drive by our house often. One old man who wore red mittens and a white beard—we thought looked like Santa Claus.\n\nThe water came from one of those \"crystal springs\" on the hillside above our house, but often there was much work for men to do to keep the water running. If it should freeze up at the beginning of winter one would face the prospect of carrying water a long time.\n\nAway up there on the hill back of our place but in sight of it was a prominent rock or ledge of rocks that made the best playhouse with places we called rooms and shelves and beds. The hollows around made more rooms and the bright patches of ferns or \"brakes\" made green little islands.\n\nWhen the ice broke up and went out of the pond in spring with a great roar, it was a matter of news and one would say to another, \"Did you hear the ice go out?\" Quite a sight it was too.\n\nOne of my earliest recollections is the sound of the swiftly flowing stream in Spring when water was high, and the smell of the newly scrubbed paint, as it was house cleaning time, and I would move into a room that was too cold to sleep in winter, and nearer the running brook.\n\nFlowers require so much more artificial watering than almost any place in our country, but it is not as easy to grow flowers as here; not in villages without a water system. Many shrubs would not endure the cold winter and the summer season is short. Lilacs and syringa, flowering almond, little Scotch roses, cinnamon roses, honeysuckle are found in all old gardens, and the spring bulbs and many other things do well with cultivation. But I know that field daisies with ferns were used to decorate for Children's Sunday, and people would bring their best house plants to the church.\n\nIn mid-summer came the berry season and it was more of a recreation than a task, to climb, a few times, almost straight up, to the \"upper hundred\" where wild raspberries grew. I recall the soft mountain air, the hazy hills, the way our voices sounded in that high place.\n\nFirst we put green leaves in our hats, maple leaves probably, to guard against sun stroke and proceeded to fill our pails. \"How many have you picked?\" \"Is the bottom covered yet?\" And then perhaps our fathers would say, when we got home \"Did you pick them, or eat them?\"\n\nBlackberries came later, down on the meadows—not quite so much fun! We got scratched and mosquito-bitten. The whole family went and the men and boys went to work in earnest, but the berries were fine.\n\nBeautiful leaves and nuts came in Fall. Butternuts were gathered, and children put under the trees and watched the squirrels working. Apples were a great crop and everyone had the fruit. Harvest apples ripened first—the old people used to say they were good \"in their day.\" Most were picked and stored in the cellar—for pies, sauce, and to eat raw, but some hung on until winter. It was easy for children to get as many as they wanted.\n\nWe roamed over the fields rather freely. Only in our part of the country, children must be warned against rattlesnakes. And bears, though we talked a lot about them, there was no danger. Gypsies came occasionally, and mothers cautioned the children to stay in. \n\nThe apples of commerce came from the orchard and were hauled to the cider mills to be converted into barrels of cider—which could later become vinegar. The blankets are spread under the tree to catch them as they are shaken from the tree. Corn huskings and corn roasts were social features of the season.\n\nThere were singing schools in winter, but I believe they were getting a little old fashioned, even in my time. I went a little. And I remember very well attending the \"Lyceum' held by the older people (I looked up the word—an association for debate and literary improvement).\n\nSuch questions as, \"Resolved that Chinese Immigration should be prohibited\" were argued and probably co-education much talked of then as colleges began to open their doors to women very soon.\n\nA woman I knew had said \"When my son goes to college his sister goes with him.\" Her prophecy was realized for both her children entered Tufts in Massachusetts. When the town Superintendent or any visitor came to our village school he was asked to \"make a few remarks.\"\n\nThe superintendent I remember best was a retired Congregational minister, sometimes I heard him preach. He wore his white hair rather long—almost to his shoulders, and loved children. His message to school children was always \"Be good.\" Quite a man, though, who could preach a good sermon.\n\nVery few people traveled, but there were journeys to visit cousins living farther south of us, usually Massachusetts.\n\nThere were journeys to my father's home state, Connecticut, on the cars, of course—and on one of the earliest my parents took me with them to the Centennial Exposition in Philadelphia. I was too young to remember much but I do think I remember the place where we spent the nights, with cousins in New Jersey. There were many strawberries and it was very warm.\n\nThis story has been told to me—At the Centennial there was an exhibit of some very fine wax figures. As I was tired, my father found a seat available near these figures and held me while I went to sleep. We were there for a long time perfectly quiet. Many, many people came along, looked over the wax works, then seeing this man and child, hesitated a bit, showed there were a little puzzled—then smiled and passed on. They were real!!\n\nI went up to Montpelier when my father was the \"gentleman from Stockbridge,\" in the legislature, and as he was a Civil War veteran we went to soldiers' reunions and camp meetings now and then. I believe my first ice cream came from a church social, and it was a very long time before I saw the second. I rather think it might have been served at a church dinner after our minister was ordained, but I'm not sure. It was a big event, many ministers came from out of town—there was a dinner in the vestry and I sat beside my grandmother and somehow we came to have a slice of lemon pie. Grandma said \"I'd rather have my own.\" We also had a sponge caster and a pine apple cheese. I had never seen a cheese like that but as we drove about, we saw a factory where they were made.\n\nThen on our way home we stopped at Northhampton, Mass.—and rode in horse cars around to see Smith College and a glimpse of the beautiful Connecticut valley.\n\nI did not know what my father was seeking and think I had little curiosity. He always used to tell me to \"wait and see\" if I had too many questions. I suppose that was what I was doing. Later I found out it was to see if he had a Revolutionary ancestor. He didn't discover one.\n\nA visit to Boston and excursion to Plymouth came later—All the passengers as they landed walked over the \"rock\"—(doubted).\n\nI marvel as I think how church services and other institutions were kept up in the rigorous climate, with the hard work needed to gain a livelihood. In our church there was a choir loft opposite the pulpit, people turned around to face the choir as they stood for the hymns—this was changed later. I've been told those who joined the church by \"confession of faith\" stood and told of their spiritual experience. I do not know at just what time this was changed.\n\nThis is certainly antiquated. I never, never have been in love with a person who had entered a tavern.\n\nVermont had then been a dry state for sixty years. Instruction of effects of alcohol was compulsory in public schools for every grade. After the books were studies as long as the teacher thought sufficient, they would be used as reading books three days a week. It was a good thing, \"line upon line.\"\n\nI meant to speak of the peddlers—there was the regular meat cart, and in the summer the hulled corn man who rang a bell as he came along, and the tin peddler whose cart was painted red. Besides tin ware he carried brooms and some other things and would take rags in part payment. Aluminum was unknown and even granite was a new thing. Pack peddlers we were rather afraid of and did not like to let them in but old John Todd—partially blind—we knew well. He trudged around carrying two satchels. He had combs, needles and pins, silk on the spool, and silk in the hank.\n\nThe home in the little village of Gaysville, Vermont is still there."
}
