{
  "slug": "1900s",
  "name": "1900s News",
  "sourceUrl": "https://sites.google.com/view/orcashistoryresearch/news-by-year/1900s",
  "yearsIncluded": ["1901", "1902", "1903", "1904", "1905", "1906", "1907"],

  "rawContent": "1901\n\nJuly\nCraft & Co., of Whatcom, are reported to be putting in a fish trap near Point Lawrence, Orcas island. Mr. Craft is the proprietor of the Famous Shoe Store and has for years been a constant advertiser in The Islander.\n\nAugust\nMr. and Mrs. Craft, of Whatcom, and Mr. McDonald, state dairy commissioner, of Seattle, visited Mr. Craft's fish trap at Point Lawrence, Sunday. The little trap is doing finely.\n\nSeptember\nHarry Abbott, of Whatcom, was over to Point Lawrence Sunday in his sloop Ariadne with a party of friends, hunting the noble deer.\n\nNovember\nMr. and Mrs. Hansen and their two children returned to Fairhaven Tuesday for the winter. Mr. Hansen is interested in the Point Lawrence Fish Company's trap at the Alderbrook farm beach.\n\n1902\n\nJanuary\nOne of the most astonishing freaks of the recent windstorm was reported near Alderbrook farm. The wind not only played havoc with fences but blew post holes out of the ground.\n\nMay\nThe Point Lawrence fish trap is nearly completed, having been driven out 200 feet or more further than it was last year. Owners of an adjoining location claim that as now driven it encroaches upon their rights. A bunk house has been built on the beach at the Craft place.\n\nL. Savage will ship twelve deceased hogs to Whatcom by the schooner Wanderer next Tuesday, and four hogs and one beef will go from Alderbrook farm.\n\nJune\nMr. and Mrs. Craft and several friends from Whatcom were over to Point Lawrence Sunday.\n\nThe Lawrence Fish Company has given up the effort to drive a trap directly out from Point Lawrence this season and is now driving at the Paternosier place, near Doe Bay.\n\nThe Point Lawrence fish trap has been catching quite a number of salmon. The Point Lawrence Fish Company's trap in front of Paternosier's place is completed and a good catch is expected.\n\nOctober\nA communication from Doe Bay telling the story of a most commendable attempt to enforce the game law there. Warrants for arrest were sworn out before Justice Morrow at Olga and placed in the hands of P. Soderbom, A Ohlert and Wm. Viereck, as special constables. They were scouring the hills and watching the hunters' camp all Saturday afternoon. At twilight that evening the hunters reached their camp at Point Lawrence.\n\n1903\n\nJanuary\nDamage was done to fish traps, especially to the P. P. & N. Co's big trap at Mosquito pass, the big A. P. A. Trap on the salmon banks, and the Wormer trap at the south end of Lopez. The Craft trap at Point Lawrence was also damaged.\n\nFebruary\nAlbert Soderbom, of Fairhaven, is visiting his brother near Point Lawrence.\n\nThe piles and the logs for the lumber for the Doe Bay wharf are all in the water. The driver is expected this week.\n\nJuly\nMr. and Mrs. S. J. Craft and daughter moved over to their farm at Point Lawrence last Sunday. Mr. Craft's trap is getting quite a lot of sockeyes.\n\nAugust\nMr. and Mrs. Craft's guests were conveyed to Point Lawrence by Mr. and Mrs. T. R. Kershaw in the state fish commissioner's steam yacht.\n\nThe 2-year old baby daughter of Mr. and Mrs. S. J. Craft of this city, was attacked yesterday morning at the Craft summer home near Point Lawrence, on Orcas Island, by a Great Dane dog belonging to the family. The dog was a wonder, weighing more than 150 pounds. The child was either bitten or clawed about the face, one of its eyes being severely cut. The dog was promptly killed.\n\n1904\n\nMay\nThere is some talk of Blaine parties driving the Craft trap at Point Lawrence.\n\nThere are at least twenty tents pitched at various points around the shores of Buck Bay, Doe Bay, and near Point Lawrence this week, all sheltering fishermen and members of fish trap crews, mostly from British Columbia.\n\nOctober\nA deer was seen at one time near Point Lawrence.\n\n1905\n\nMay\nMr. Hansen came over from Bellingham Monday to superintend the work on the Craft-Hansen trap at Point Lawrence.\n\nOctober\nThe advertisements that Alderbrook farm was for lease brought twenty-five responses. Mr. Culver has about concluded a lease to Mr. Sparks, of Van Buren, Whatcom county.\n\nMr. and Mrs. Geo. McMillan, of Bow, Skagit county, were guests of G. N. Culver, Wednesday and Thursday. They came over to see Mr. Culver about leasing Alderbrook farm.\n\n1906\n\nJanuary\nA new sheep shed is about complete at Alderbrook farm.\n\nMarch\nThe steamer Islander met with what might have been a very serious mishap last Saturday evening. A few minutes after leaving Doe Bay and when only a short distance off the Peninsula, near Point Lawrence, something gave way in the steering gear. She reached the dock at Bellingham about four o'clock Sunday morning. Capt. Basford says that after passing Point Lawrence and the small islands mentioned there was little danger.\n\nAugust\nMiss Dora Shull has returned to Alderbrook farm, near Doe Bay, to spend a few weeks taking painting lessons from Mr. G. N. Culver.\n\n1907\n\nFebruary\nCounty-Surveyor Allen surveyed the old Estelle lime property, near Point Lawrence, Orcas island, a few days ago. It has been purchased by the Chuckanut Portland Cement Company.\n\nL. A. Blakeslee and family, who have been living on Alderbrook farm for the past year, moved back to Bellingham, Thursday.\n\nJuly\nLloyd Joubert spent most of the week at Alderbrook farm, near Doe Bay, picking cherries in the large orchard there and also doing a little haying.\n\nSeveral hundred pounds of magnificent Royal Ann cherries from Alderbrook farm were marketed this week.",

  "extractedAt": "2026-01-14",
  "notes": "News items from The Islander newspaper mentioning Point Lawrence and Culver family"
}
