{
  "slug": "1910s",
  "name": "1910s News",
  "sourceUrl": "https://sites.google.com/view/orcashistoryresearch/news-by-year/1910s",
  "yearsIncluded": ["1910", "1911", "1912", "1913", "1914"],

  "rawContent": "1910\n\nJuly\nMisses Vivian Todd and Adeline Nelson are visiting for a few days with Misses Evelyn and Leda Culver at Mr. and Mrs. O. H. Culver's summer camp at Alderbrook farm, Orcas island.\n\n1911\n\nFebruary\nMr. and Mrs. S. J. Craft came over from Bellingham the first of the week for a short stay at their fine country home at \"Sea Acres.\"\n\nMarch\nKarl Minch went to Friday Harbor Tuesday to get medical advice about a sprained ankle. Mr. Minch has nearly closed a deal for working Alderbrook farm this season.\n\nG. N. Culver made a business trip to Friday Harbor Tuesday returning Wednesday, accompanied by Mrs. Culver, who had been visiting her two sons and their families the last three weeks.\n\nG. R. Emerging is pruning the orchard at Alderbrook Farm.\n\nMay\nG. N. Culver came from Friday Harbor last Saturday afternoon to look after the bees and some other business at Alderbrook farm and also to bring over the cook stove to their rooms in the Odd Fellow's building to be used during the summer.\n\nG. N. Culver is attending to his bees and other matters at Alderbrook farm and expects to make his home there this summer, although his family will live in town.\n\nMrs. G. N. Culver has rented rooms in the Odd Fellow's block for the summer.\n\nSeptember\nThe new public dock at the Craft place near Point Lawrence is completed. Mr. Craft is the owner of a large estate there which he calls \"Sea Acres.\"\n\nDecember\nG. N. Culver is at Doe Bay this week arranging for the leasing of Alderbrook farm, for next season.\n\n1912\n\n1913\n\nJanuary\nMr. Rogers who has leased Alderbrook farm for a year, is expected here this week from Tolt, Wash., where he went to get his family.\n\nG. N. Culver arrived in the city Tuesday from Doe Bay. Having leased Alderbrook farm, he will remain here most of the time.\n\nJohn Rogers and family spent the day Sunday with their brother James Rogers at Alderbrook farm.\n\nG. N. Culver is out again after being confined to the house for the past two weeks with the grip.\n\nMarch\nG. N. Culver is spending a few days at Alderbrook farm. He expects to return to Friday Harbor Monday.\n\nSeptember\nMr. and Mrs. Rogers and daughter Marion, who have spent the last eight months at Alderbrook farm, left Saturday for their new home in Oregon.\n\nMr. G. N. Culver is spending a few days at Alderbrook farm.\n\nOctober\nG. N. Culver of Alderbrook farm made a shipment of King apples to Seattle on Monday that will make the east of the mountain growers hustle to beat.\n\n1914\n\nApril\nMrs. G. N. Culver, who had the great misfortune to break her left hip at Alderbrook farm, Orcas Island, April 4th., is reported to be getting along as nicely as could be expected at the home of her son here. It is the second time within a little over two years that she has had to endure the same trying ordeal, having broken her right hip Jan. 31, 1912, when visiting her son and family here.",

  "extractedAt": "2026-01-14",
  "notes": "News items from The Islander newspaper mentioning Point Lawrence and Culver family"
}
