{
  "slug": "culver-diana-aiken",
  "displayName": "Diana Louise (Aiken) Culver",
  "sourceUrl": "https://sites.google.com/view/orcashistoryresearch/people/culver-diana-aiken",

  "connectionToPtLawrence": "Diana and her husband George Nelson Culver lived at Alderbrook Farm on the east end of Orcas Island, between Doe Bay and Pt. Lawrence, which they established starting in 1892.",

  "family": {
    "parents": "Hiram Aikens and Louisa Heath",
    "spouses": "George Nelson Culver",
    "children": "Otis Henry Culver, Fred Nelson Culver, Emma Louise Culver, Inez Adel Culver",
    "siblings": "Mary (sister), Agnes (sister)"
  },

  "keyDates": "1836-1920 (d. Age 83)",

  "timeline": [
    {"year": 1836, "age": 0, "event": "June 29: Birth of Diana Louisa Aiken, Barnard, Vermont"},
    {"year": 1850, "age": 14, "event": "Diana living with her parents in Barnard, Vermont"},
    {"year": 1862, "age": 26, "event": "Married George Nelson Culver"},
    {"year": 1862, "age": 26, "event": "November 1: Birth of Otis Henry Culver (Gaysville, Vermont)"},
    {"year": 1864, "age": 28, "event": "Birth of Inez Adel Culver"},
    {"year": 1866, "age": 30, "event": "September 1: Birth of Fred Nelson Culver (Gaysville, Vermont)"},
    {"year": 1870, "age": 34, "event": "Diana and George Nelson Culver were living in Stockbridge, Windsor, Vermont and Nelson was a grocery keeper"},
    {"year": 1872, "age": 36, "event": "October 2: Birth of Emma Louise Culver (Gaysville, Vermont)"},
    {"year": 1876, "age": 40, "event": "Family moved to Des Moines, Iowa; built home at 1708 Woodland Ave"},
    {"year": 1880, "age": 44, "event": "Diana and George Nelson Culver were living in Des Moines, Polk, Iowa and George was a bookkeeper"},
    {"year": 1882, "age": 46, "event": "Family moved to Jamestown, Dakota Territory"},
    {"year": 1884, "age": 48, "event": "Family moved to Murray, Idaho (mining boomtown)"},
    {"year": 1889, "age": 53, "event": "Family moved to Spokane"},
    {"year": 1892, "age": 56, "event": "Nelson began buying property on east end of Orcas Island, between Doe Bay and Pt. Lawrence"},
    {"year": 1900, "age": 64, "event": "Diana and George Nelson Culver were living on Orcas Island, WA and George Nelson was a farmer"},
    {"year": 1902, "age": 66, "event": "June: Hosted wedding of daughter Emma Louise to Cecil Willis at Alderbrook"},
    {"year": 1905, "age": 69, "event": "June: Telephone installed at Alderbrook"},
    {"year": 1910, "age": 74, "event": "Diana and George Nelson Culver were living on Orcas Island, WA and George Nelson was a farmer"},
    {"year": 1911, "age": 75, "event": "Nelson broke his leg; Diana and Nelson moved in with son Otis in Friday Harbor"},
    {"year": 1913, "age": 77, "event": "Farm leased to Mr. T.E. Rogers; Diana's sister Agnes died at age 64"},
    {"year": 1914, "age": 78, "event": "April 4: Diana fell and broke her left hip; moved in permanently with Otis and Mabel"},
    {"year": 1918, "age": 81, "event": "January 13: Diana's husband George Nelson Culver died of a stroke"},
    {"year": 1920, "age": 83, "event": "January 14: Diana died in Friday Harbor, Washington. Buried in family plot at Olga cemetery"}
  ],

  "biography": "Biographical Notes by David M. Hall: January 2020\n\nIn January 2018, I wrote a tribute to my great-great grandfather Nelson Culver, on the centenary of his passing in 1918. Two years later, on January 14, 1920, his widow, Diana Louise Aiken Culver, died at her son's home in Friday Harbor, WA on San Juan Island. This is what I know of her story.\n\nMy great-great grandmother was born Diana Louisa Aiken, on June 29, 1836 in Barnard, Vermont, the first of four children born to Hiram and Louisa Aiken. Hiram was a prominent citizen, who served several terms in the Vermont legislature. Barnard is a small town in central Vermont, at the head of a picturesque lake. There were several branches of the family in Barnard, some of whom spelled their name \"Aikens.\" They were of Scottish descent. Her grandfather, Solomon Aikens, was a veteran of the Revolutionary War.\n\nAccording to her granddaughter Evelyn, Diana spoke often of \"being thankful for higher education, which was afforded to her in a college-preparatory school.\" This was Goddard Seminary in Barre, Vermont, a school that offered secondary education for both boys and girls. It was unusual in that era for women to seek a high level of education. At Goddard, Diana excelled in art, and was a good student in French and German. Goddard was a progressive school for the times; Princeton, for example, did not admit undergraduate women until 1969. Goddard had been founded by Universalists. Many of the Aikens, including Diana, were members of the Universalist Church.\n\nOn November 28, 1861, 25 year-old Diana married 26 year-old George Nelson Culver. Mr. Culver was from Pomfret, a small town about 7 miles from Barnard. We don't know how they met. The ceremony was performed at the home of Diana's parents. There is a tintype photo of the couple that appears to be a wedding portrait. The Culvers made their home in Gaysville, a village 10 miles from Barnard.\n\nAlso in 1861, the Civil War had started. Nelson was excused from service due to a crippled leg from an old injury. But he wanted to support the cause, and paid a fee for a \"replacement\" soldier.\n\nFour children were born to Nelson and Diana. Otis, my great grandfather, was born in 1862. Inez was born in 1864, and died at the age of 2. Fred was born in 1866, and Emma Louise (Lou) in 1872. There is a photo of the entire family, taken about 1878, with Lou's age appearing to be about six.\n\nAt some point while they were living in Gaysville, Diana had a large tumor surgically removed. The surgery involved a not very scientific application of chloroform or ether.\n\nIn the early 1870's, Diana's sister Mary had moved to Iowa, and was joined there in 1874 by Agnes. We don't know what the attraction of Iowa was, but in 1876, the Culver family moved to Des Moines, and built a home at 1708 Woodland Ave. In the 1880 census, Nelson listed his occupation as \"bookkeeper.\"\n\nDiana was a very talented artist, and in Des Moines she had the opportunity to attend art exhibits at several galleries. Many of her works are now spread throughout the network of her many descendants. She painted watercolors, oils, and pastels, and did a great deal of china painting - cups, saucers, plates and pitchers. She sometimes entered her work in county fairs, and won many awards.\n\nIn 1882, the family moved to Jamestown, Dakota Territory. Jamestown is about halfway between Fargo and Bismarck. In 1880, the population was only 393, but grew to about 2,300 in the ensuing 10 years, after incorporating in 1883. Nelson Culver was Secretary of the North Dakota Loan & Trust Co., and was also involved in city planning. Son Otis, who went by \"O.H.\" rejoined the family after graduating from the University of Minnesota, and was hired as Principal of the Jamestown High School.\n\nIn 1884, when Diana was 48, the family uprooted again. In his own words, Nelson was \"lured by the cry of gold to the wilds of the Coeur d'Alene region of Idaho.\" They lived for five years in Murray, Idaho which was a mining boomtown. Another resident of Murray in 1884 was Wyatt Earp. Nelson and Diana were also hopeful that the mountain air would be beneficial to their 18 year-old son Fred, whose health was poor. I don't know that the Culvers engaged in any mining. More likely, the plan was to make money off of the miners. Nelson had a \"mercantile\" business. O.H. started a newspaper. Diana continued to paint. In 1889, when the family moved to Spokane, the move was financed in part, according to oral family history, by the sale of Diana's paintings.\n\nIn Spokane, sons O.H. and Fred, ages 27 and 23, opened a publication and print shop. In 1890, the business was destroyed in a fire, and Fred moved to Tacoma. O.H. had married Mabel Smith, of Gaysville, VT. He and Fred bought a weekly newspaper, the Islander, in Friday Harbor on San Juan Island.\n\nIn 1892, Nelson began buying property on the east end of Orcas Island, between Doe Bay and Pt. Lawrence. Over the next two years he purchased over 200 acres, and built a fine Victorian home which he called \"Alderbrook.\"\n\nPerhaps by the end of the year, Nelson and Diana were able to move into their fine new home, which is still standing. Nelson and Diana were now in their early 60's. The farm grew apples and plums. They also raised sheep, pigs, and chickens, and had a vegetable garden. Their daughter Lou, in her early 20's, lived with them when not attending school to become a teacher. Diana's sisters lived up the hill on their own little farm. O.H. had married Mabel Smith, of Gaysville, VT. He and Fred bought a weekly newspaper, the Islander, in Friday Harbor on San Juan Island. Diana and Nelson's first grandchild, Evelyn, was born in 1895. Some of what we know about the Culvers was passed down in the stories of their grandchildren, who cherished their visits to the farm. Evelyn wrote of being there at Christmas when she was about five years old, and remembered the tree in the library, and the life-sized rag dolls that she and her sister received. There is a photo of that tree, with the dolls beneath it, probably Christmas 1900.\n\nThere was a spare bedroom upstairs that was called \"The Studio\" where Diana created her art. She did a great deal of ceramic painting here, taking pieces to Bellingham to be fired. She gave away most of her works to family and friends. There is not a lot of room to paint on a teacup, and I am amazed at the detail in Diana's work. A single, tiny leaf might have three shades of green, veins, and shadows. Miniscule flower stamens are shaded on their undersides. The skies in some of her paintings are a breathtaking shade of blue. Many of her paintings were hung in her attractively decorated house. Diana had art students who would sometimes stay at the house for a week while taking lessons.\n\nIn June, 1902, the Culvers hosted the wedding of their daughter to Mr. Cecil Willis. We have a photo of the wedding party in front of the house. Granddaughters Evelyn (6) and Leda (4) were flower girls.\n\nAlthough the house lacked such amenities as plumbing and electricity, high tech came to Alderbrook in June 1905, when a telephone was installed. Everyone with a phone on that side of the island could listen in on everyone else's calls. Nelson sold advertising and wrote a column for the Islander for a few months.\n\nBy July, 75 year-old Nelson was back on Orcas, running the farm. On July 24th, he broke his right thigh above the knee. After having surgery in Seattle, he and Diana moved in with Otis in Friday Harbor. In December, he fell and broke his leg again. The farm was leased out for the year 1913 to a Mr. T.E. Rogers, and the Culvers continued to live with Otis and Mabel. In August, Diana's youngest sister, Agnes, died at age 64.\n\nIn 1914, now in their late 70's, Diana and Nelson were back on Orcas at Alderbrook. On April 4, Diana fell and broke her left hip. She and Nelson then moved in permanently with Otis and Mabel and their five grandchildren. Diana never recovered her mobility, requiring assistance to get up or down, or walk. Nelson was attentive to her every need, and Evelyn then 19, recalled that \"he downright flirted\" with his wife, who, Evelyn wrote, was a \"most patient, good-humored and appreciative person.\" Diana stayed busy with reading, sewing, and writing long letters to friends and relatives.\n\nIn January, 1918, Nelson Culver died of a stroke. Diana died two years later, on January 14th, 1920, at age 83. They are buried in the family plot at the Olga cemetery on Orcas Island.",

  "miscellaneous": "Occupation: Artist (watercolors, oils, pastels, china painting). Attended Goddard Seminary in Barre, Vermont. Member of the Universalist Church. Known for very detailed ceramic painting work.",

  "researchQuestions": [],

  "extractedAt": "2026-01-14"
}
