{
  "slug": "1890s",
  "decade": "1890s",
  "extractedAt": "2026-01-15T21:40:00.000Z",
  "yearsIncluded": ["1895", "1896", "1897", "1898", "1899"],
  "rawContent": "1895\n\nJuly\n\nLeslie Darwin and Lew Berens, of New Whatcom, brought Mr. and Mrs. O. H. Culver and the Misses Simpson of Fairhaven, over to Point Lawrence Friday night in the fine sloop Mabel, of Whatcom, and returned with them Monday Morning.\n\nSaturday evening last there was a delightful little dinner party at the pleasant home of Miss Aiken and Miss Agnes Aiken, near Point Lawrence, given by them in honor of the birthday of their sister, Mrs. G.N. Culver. Those present were Mr. and Mrs. Culver, Miss Culver, Mr. Alex Chalmers, Mr. Bert Chalmers and Mr. Holt, of Doe Bay, Mr. Jas. Geoghegan of Eastsound, Mr. and Mrs. O.H. Culver and Misses Blanche and Pearl Simpson of Fairhaven.\n\nFire at Alderbrook: The old Alderbrook farm house, near Doe Bay, Orcas island, belonging to G. N. And O. H. Culver, was entirely destroyed by fire shortly before noon last Thursday, with nearly all its contents. No one was in the house at the time of the fire, and no one knew just how the fire originated; though the general supposition is that defective flues were the cause. By the heroic efforts of the neighbors most of the kitchen furniture and a little from other rooms was saved, but a great deal of valuable property, including an old piano, a fine sewing machine, family photographs, letters and papers for many years accumulated, which can never be replaced, went up in smoke. The loss amounts to $1,500 or $2,000, on which there was $500 insurance in the People's Company of Manchester, N. H., for which Messrs. Cowgill & Sager were agents. The family immediately began to arrange temporary quarters in an old building near at hand, while G. N. Culver departed for Whatcom on a business trip connected with the affair. It is to be hoped the loss will be fully adjusted and that it will not be long ere the old place will be restored.  Mr. & Mrs. Culver and their daughter Louise were spending the day with their sisters, the Misses Aiken, when the fire broke out.\n\nMrs. G. N. Culver, of Alderbrook Farm, Orcas Island, is visiting friends and taking in the fair at Whatcom this week.\n\nOctober\n\nRoad Supervisor Boone, of road district No. 4, has opened the new road from Doe Bay towards Point Lawrence, as far as the school house in district No. 14, and has issued invitations to people interested to contribute labor, hoping to complete a good wagon road to the end of the survey.\n\nNovember\n\nMiss Blanche Simpson of Fairhaven, is visiting Miss Culver at Alderbrook Farm near Point Lawrence.\n\nDecember\n\nMr. G. N. Culver, of Alderbrook Farm, Point Lawrence, returned from a short visit to the Bay Cities, on the Buckeye, Monday.\n\nMiss Agnes Aiken, of Point Lawrence, returned on the Buckeye, Monday, from Whatcom, where she has been for the past few days visiting her nephew, O.H. Culver and family.\n\n1896\n\nJanuary\n\nD. J. Slattery, of Point Lawrence, who is a stonemason, is at work upon the new Normal school building on Bellingham Bay.\n\nMr. O.H. Culver of New Whatcom, came over to his ranch near Point Lawrence, Monday.\n\nFebruary\n\nMrs. G. N. Culver, of Point Lawrence, Orcas Island, is visiting her son, O.H. Culver and family, at New Whatcom.\n\nWilliam and John Viereck have become disgusted with shingle bolt cutting in Whatcom County and quit.  William has gone to Seattle to hunt for another job and John is working for G.N. and O.H. Culver at Alderbrook farm, Point Lawrence.\n\nMiss Louise Culver, of Alderbrook farm, Point Lawrence, went to Whatcom the last of the week to make her brother O.H. Culver and family. a two or three weeks visit.\n\nA representative of this journal in walking from Doe Bay to Point Lawrence, Orcas Island, last Saturday afternoon was pleased to note the many improvements on the various ranches which he passed and also in the county road. Many of the ranches which have heretofore been the unmolested home of the aphids and caterpillar and have seldom, if ever, seen the use of the pruning knife, have during the past winter been well pruned and the trees are now white with spray; the land has been well cultivated and put into garden or hay. As a consequence everybody is anticipating an excellent fruit crop, and the season could hardly have opened in a more satisfactory manner for the success of the farmers.\n\nMarch\n\nMr. G. N. Culver, of Alderbrook Farm, Point Lawrence, came in on the Buckeye to attend the McKinley meeting at Eastsound. He remained over until Tuesday, transacting business at the Harbor.\n\nApril\n\nMiss Louise Culver, of Point Lawrence, returned to her home on the Buckeye, last Friday, after a visit of about three weeks with her brother O.H. Culver and wife at Whatcom.\n\nMrs. G. N. Culver, of Alderbrook Farm, Point Lawrence, came over on the Buckeye, Saturday. She has been spending the past several weeks with her son, Mr. F. N. Culver and family, at the Harbor, giving lessons in painting to quite a class during part of her stay.\n\nJune\n\nMiss Blanche Simpson of Fairhaven is enjoying a visit at Alderbrook Farm, near Point Lawrence.\n\nJuly\n\nMrs. F. N. Culver and her little daughter, of Friday Harbor, are spending a part of the strawberry season at Alderbrook farm, Point Lawrence.\n\nCapt. H. P. Lovejoy and wife, and Mr. and Mrs. E. G. Earle and a few friends of Coupeville, are enjoying a few days outing and are camped on a fine beach near Point Lawrence, Orcas Island.\n\nThe fine new sloop, Xors, of Seattle, Captain Hensen, dropped anchor in the harbor on Tuesday evening. She had on board a merry cruising party composed of Mr. and Mrs. T. K. Clark, Miss. Jennie Clark, Mr. Thos. Clark, and Captain Hensen of Seattle, Mr. Alex Chalmers and Mr. Bert Chalmers, of Doe Bay, Mr. and Mrs. G. N. Culver, Miss Louise Culver, and Miss Mary L. Aiken, of Point Lawrence, Orcas Island. The sloop is chartered by Mr. T. K. Clark and is out for a three weeks cruise. The Xors is 37 feet long, 12 feet beam, 26 tons register, and cost in the neighborhood of $2,700. She is the fastest of the Seattle yachts, and her owner, Capt. Hensen, is the commodore of the Seattle Yacht Club.\n\nAugust\n\nMrs. G. N. Culver, of Point Lawrence, Orcas island, left on Friday's boat for Fairhaven to spend a few weeks with her son, Mr. O. H. Culver and family.\n\nSeptember\n\nMr. F. N. Culver and family returned home last week from a two weeks sail boat cruise in the waters of the archipelago.  The party consisted of the following persons, who, while, here were the guests of Mr. and Mrs. F. N. Culver: Mrs. Jas. T. Gander and Mr. A. McLean, of Fairhaven, brother and sister of Mrs. Culver, Miss E. Louise Culver, Point Lawrence, Orcas Island, Miss Nellie Dasher, of Puyallup, and Mr. John G. Viereck Jr., of Point Lawrence. Mr. Viereck, who had charge of the boat and handled the ribbons to the sails, is one of the safest and most trusted sailors on the Sound and is thoroughly acquainted with the Sound waters and tributaries.\n\nOctober\n\nMrs. G. N. Culver, of Point Lawrence, Orcas island, has been in the city for several days past the guest of her son, Mr. F. N. Culver and family.\n\nNovember\n\nMiss Louise Culver, of Point Lawrence, is visiting her brother O. H. Culver and family in Whatcom this week.\n\nMrs. G. N. Culver returned to Point Lawrence, Monday, from a week's visit with her son and family, in Whatcom.\n\nMiss Louise Culver, of Point Lawrence, is in the Harbor attending the Annual Teachers' Institute. She is the guest of her brother, Mr. F. N. Culver and family.\n\nDecember\n\nThe body of an unknown man was found Wednesday at the lighthouse point near Point Lawrence, Orcas island, by Mr. John Gray of Doe Bay. His report brought out Coroner Minnich, who with W. D. Katz and F. N. Culver and others went to the scene of death. Mr. Dan Slattery was hunted up by him and accompanied them and at once identified the body as being that of Philip Wenzel, a German, who not long since filed on a piece of land near there. The unfortunate man had evidently been dead for some time, but on account of the cold weather, and the cold salt water at high tide covering him, the body was still in a fair state of preservation. He had on one shoe and stocking, a good suit of navy blue clothes, a double breasted blue flannel overskirt and a good neck tie. On his person were found several letters and papers, a certificate of deposit for $140 issued by the First National Bank, of Seattle, and $62.80 in money, (three $20 gold pieces and the balance in small change), which the coroner now has in his charge. The coroner ordered the body buried on the lighthouse reserve at Point Lawrence. Mr. Wenzel had acted queerly for some time before his disappearance, and judging from the scene at his cabin, was likely insane. Hung on the corners of his bed were found queer pictures which he had made of himself when wholly nude. His neighbors believe that a streak of partial insanity inherited by some of his family had taken possession of this young fellow who started so full of promise for a new home in a new country. Mr. Wenzel was from Wisconsin, and a letter will be sent to his relatives telling them of his sad death.\n\nMr. W. P. Calhoun, who has been employed at the Driftwood Lime Works, on San Juan island, for several months past, has gone to his home near Point Lawrence, where he has some improvements to make on his land.\n\nMr. John G. Viereck, Jr., who has been working at the lime kilns on San Juan for some time past, returned last week to his home at Point Lawrence. He will probably go to Grand Forks, where his father has a large farm upon which he desires his sons assistance.\n\nRoy Reilly, about 18 years old, a son of Mr. and Mrs. William Reilly, who formerly kept a restaurant at Sehome Junction, was drowned near Point Lawrence, Orcas Island, in the heavy gale last Wednesday. He was trying to cross from Clark's Island, too Orcas in a small boat. His father, who was on Clark's island, saw him disappear, but was powerless to help him, and was unable to get away from the island until Friday. The boy had got out in his boat to tow another boat ashore, which had gone adrift. Fragments of one boat were found yesterday at Point Lawrence, and the other near Peavine Pass, about seven miles from Clark's island.\n\nMr. D. J. Slattery, of Point Lawrence, Orcas Island, was in town the first of the week on business.\n\nMrs. Wm. Reilly, of Point Lawrence, Orcas Island, spent Christmas visiting her parents and friends at Whatcom.\n\n1897\n\nFebruary\n\nThe enterprising residents of the Point Lawrence district, on the eastern end of Orcas island, are looking into the advantages of having a telephone line to connect them with the Eastsound exchange. No doubt this will be put in at an early date.\n\nMarch\n\nMrs. G. N. Culver, of Point Lawrence, Orcas island, was in the Harbor last week the guest of her son F. N. Culver and family. While here she gave painting lessons to a class of four or five, who had been waiting her arrival for two or three weeks past. She left today for her home at Point Lawrence, Orcas Island.\n\nMay\n\nMrs. G. N. Culver, of Alderbrook Farm, Point Lawrence, is in the Harbor visiting her son F. N. Culver and family.\n\nJune\n\nMrs. G. N. Culver, of Point Lawrence, Orcas island, returned to her home on the Buckeye, Saturday, after a three weeks visit with her son F. N. Culver and family.\n\nMiss Agnes Aiken returned yesterday to her home near Point Lawrence after spending a few days with relatives here. (Seattle Daily Intelligencer)\n\nJuly\n\nA pleasant trip was made to Point Lawrence with Mr. H. D. Mahler's launch last week by Mr. and Mrs. H. D. Mahler and son Howard, Misses Katheryn Rilling, Alice Hunter and Mr. Chas. Dankin.\n\nMiss Louise Culver and her aunt Miss Mary L. Aiken, have returned to Point Lawrence from a week's visit with O. H. Culver and family at New Whatcom.\n\nAugust\n\nMiss E. Louise Culver visited her brother and his family at Whatcom this week.\n\nMr. G. N. Culver of Point Lawrence, Orcas Island, visited the Bay Cities the last of the week.\n\nOctober\n\nMrs. F. N. Culver and little daughter are visiting relatives and friends at Point Lawrence, Orcas island.\n\nNovember\n\nThe building built especially for the customs office and resident of the office in charge is being thoroughly repaired and will soon be occupied by the new collector and his family. Mrs. Culver and children are now at the Culver farm, near Point Lawrence.\n\nMr. G. N. Culver, of Point Lawrence, Orcas island, was in the city on business on Friday and Saturday of last week.\n\n1898\n\nJanuary\n\nMiss Blanche Simpson returned Monday on the Buckeye, after a week's visit with friends at Fairhaven and at Point Lawrence, Orcas island.\n\nFebruary\n\nMiss Mary L. Aiken, of Point Lawrence, Orcas island, is in the Harbor, the guest of her nephew, Mr. F. N. Culver and family.\n\nMiss Louise Culver, of Point Lawrence, Orcas island, was a visitor in the Harbor last week, staying with her brother, Mr. F. N. Culver and family.\n\nMarch\n\nMrs. G. N. Culver, of Alderbrook farm, Point Lawrence, and her sister, Miss Mary L. Aiken are in the Harbor, visiting relatives and friends.\n\nApril\n\nMrs. G. N. Culver and her son, Mr. F. N. Culver and family, and Miss Aiken, of Point Lawrence, left on Tuesday morning for Bellingham Bay, on the Buckeye. Mrs. Culver and Miss Aiken will visit relatives at New Whatcom.\n\nMay\n\nMiss Agnes Aiken, of Point Lawrence, Orcas Island, returned on Tuesday, from a visit of several weeks with friends in Seattle.\n\nMiss Agnes Aiken, of Point Lawrence, came to the Harbor, Thursday evening, to meet her aunt, Miss Mary L. Aiken, who spent the past two or three months with Mrs. Dr. Rilling. They will return together to their home on the Buckeye, Saturday.\n\nJune\n\nMrs. G. N. Culver and Miss Aiken, of Point Lawrence, came in on the Buckeye, to visit relatives and friends at the Harbor.\n\nMrs. Berne's sister-in-law, Mrs. Harry Cruse, and her children, of Seattle, arrived on the Rosalie, Tuesday evening, on a visit to Mrs. Berne and family. Mrs. Cruse expects to make a stay of several weeks.\n\nJuly\n\nMiss Louise Culver, of Point Lawrence, came in on the Buckeye, Tuesday, and will spend a few days with her brother, F. N. Culver and family.\n\nAugust\n\nMiss Louise E. Culver, of Point Lawrence, returned home on the Buckeye Friday after a three weeks' vacation at Point Lawrence.\n\nSeptember\n\nFred Schmidli's new house of seven or eight rooms, between Doe Bay and Point Lawrence, is enclosed and nearly ready for plastering. When completed, it will be one of the neatest and coziest places in the eastern part of the county.\n\nOctober\n\nG. N. Culver, of Point Lawrence, Orcas Island, was in the Harbor the first of the week.\n\nJay Aiken, who had been working for the company here nearly a year, left last week to visit his aunts near Point Lawrence before seeking a situation in Whatcom.\n\nMiss Agnes Aiken, of Point Lawrence, has been in the Harbor for the past two or three days visiting relatives and friends. She left for her home, on the Buckeye, today.\n\nNovember\n\nPatents were recently received at the U.S. land office in Seattle for over one hundred homesteads in this land district. Among the number were the patents of D. J. Slattery, or Point Lawrence, and C. S. Krogh, of Stuart island.\n\nDecember\n\nMr. and Mrs. G. N. Culver, of Point Lawrence, who had been visiting her son and daughter here for a few days, returned home Tuesday.\n\n1899\n\nJune\n\nJay Aiken, fireman of the steamer Buckeye, is spending a few days visiting his aunts near Point Lawrence while the steamer is undergoing repairs.\n\nAugust\n\nMrs. Alexander McLean, of Whatcom, and her little grandchild Miss Margaret Culver, returned home Tuesday evening on the Buckeye, after a two weeks visit with Mr. and Mrs. G. N. Culver and the Misses Aiken, at Alderbrook Farm, Point Lawrence.\n\nMiss Blanch Simpson is visiting Mr. and Mrs. G. N. Culver and daughter at Alderbrook farm, Point Lawrence, Orcas island.\n\nSeptember\n\nMiss Blanch Simpson returned home Friday from Point Lawrence, Orcas island, where she had been visiting friends for a few days.\n\nOctober\n\nSmallpox Scare Causes Great Excitement on Orcas Island: News reaches here that great consternation prevails at Orcas Island, arising from what seems a totally erroneous supposition that smallpox exists on the island at Doe Bay and Olga. Fear of the disease has practically paralyzed business in this usually prosperous, quiet community. There exists no occasion for the alarm, one of the leading physicians on the island stating that it is chickenpox and not smallpox. All of the eastern end of the island is under quarantine and not a boat is allowed to land at Olga, Doe Bay or Point Lawrence. One woman has died from the disease and all those who have been exposed to the smallpox have been prohibited from leaving the islands or mingling with their neighbors. All of the neighbors, panic stricken, have abandoned their homes and fled. Armed guards patrol the beach and anyone attempting to land in opposition to the quarantine rules is quickly ordered off. Those who imagine they have the disease are confined in tents over which they forced him to deliver to them. Near Point Lawrence a pest house has been built, but so far no one will consent to become its occupant. A well informed person, just returned from Orcas Island, declares that no smallpox exists there and says that the victim supposed to have died from it really suffered dropsy. No other case has made its appearance despite the fact that a great number have been exposed. (Seattle Daily Times)\n\nNovember\n\nMiss Culver left Friday after a month's visit with her brother and family. She was prevented by the quarantine at Doe Bay and Olga from returning to her parents' home near Point Lawrence. She expected to visit there Sunday and begin teaching the winter term of school at Newhall on Monday.\n\nDecember\n\nG. N. Culver, of Point Lawrence, Orcas island, who is serving as a United States petit juror at Seattle, came home last Friday for the holidays. He will return early next week."
}
