{
  "slug": "1900s",
  "decade": "1900s",
  "extractedAt": "2026-01-15T21:45:00.000Z",
  "yearsIncluded": ["1901", "1902", "1903", "1904", "1905", "1906", "1907", "1908", "1909"],
  "rawContent": "1901\n\nJuly\n\nCraft & Co., of Whatcom, are reported to be putting in a fish trap near Point Lawrence, Orcas island. Mr. Craft is the proprietor of the Famous Shoe Store and has for years been a constant advertiser in The Islander.\n\nAugust\n\nMr. and Mrs. Craft, of Whatcom, and Mr. McDonald, state dairy commissioner, of Seattle, visited mr. Craft's fish trap at Point Lawrence, Sunday. The little trap is doing finely.\n\nSeptember\n\nHarry Abbott, of Whatcom, was over to Point Lawrence Sunday in his sloop Ariadne with a party of friends, hunting the noble deer.\n\nNovember\n\nMr. and Mrs. Hansen and their two children returned to Fairhaven Tuesday for the winter. Mr. Hansen is interested in the Point Lawrence Fish Company's trap at the Alderbrook farm beach.\n\n1902\n\nJanuary\n\nOne of the most astonishing freaks of the recent northeaster is reported from the Point Lawrence neighborhood. It doesn't appear that the wind blew any harder than at other exposed points, but the salt spray from the breakers was carried with such force and in such volume that the windows on the exposed sides of the houses were completely covered and practically sealed with salt crystals; and for forty-eight hours or more it was impossible to see out of them at all. The tangle of fallen trees was much less on the east end of the island than at Eastsound and Deer Harbor; but between Doe Bay and Point Lawrence a greater damage was done to fences than was known in those communities for many years.\n\nMay\n\nThe Point Lawrence fish trap is nearly completed, having been driven out 200 feet or more further than it was last year. Owners of an adjoining location claim that as now driven it encroaches upon their rights.\n\nJune\n\nThe Lawrence Fish Company has given up the effort to drive a trap directly out from Point Lawrence this season and is now driving at the Paternosier place, near Doe Bay.\n\nThe Point Lawrence fish trap has been catching a good many fine spring salmon, which have been shipped to Whatcom. Some of them have weighed 100 pounds and the price has ranged from four to seven cents a pound.\n\nJuly\n\nThe high tides of last week did considerable damage to fish traps, especially to the P. P. & N. Co's big trap at Mosquito pass, the big A. P. A. Trap on the salmon banks, and the Wormer trap at the south end of Lopez. The Craft trap at Point Lawrence was also damaged and doubtless there were many others injured to some extent.\n\n\"Guard Carson\", of the penitentiary, who has had charge of the blood hounds used in the Tracy chase, lived for some months on an isolated claim near the abandoned lime works on the gulf shore of Orcas island, above Point Lawrence.\n\nAlderbrook farm is sporting a new Champion hay rake now.\n\nThe Point Lawrence Fish Company's trap in front of Patermoster's place is completed and a good catch is expected.\n\nAugust\n\nG. N. Culver's apples are about the finest ever seen in the country and promise a good crop of prunes this year as well as a large variety of small fruits. The roads in that vicinity are good, except during the past two days a heavy auto had made some bad ruts.\n\nMrs. S. J. Craft, who was bitten in the face by a Great Dane dog at their summer home at Point Lawrence a few weeks ago, has fully recovered.\n\nG. N. Culver is rebuilding and enlarging the prune driers at Alderbrook farm.\n\nNovember\n\nThe residents of Orcas Island are up in arms over the depradations of a party of hunters who have been in camp at Point Lawrence. The hunters brought with them a pack of hounds and have been slaughtering the deer since their arrival. Residents of Doe Bay organized a posse and succeeded in capturing one man. The rest of the hunters managed to board their sloop, which was anchored close by, and made their escape. Al Granger is under arrest. He lives on Lummi Island, and was arrested recently for robbing fish traps. (Seattle Daily Times)\n\nHunting Deer With Hounds: Flagrant Violation of Game Law on Orcas Island: The Islander is in receipt of a communication from Doe Bay telling the story of a most commendable attempt to enforce the game law there and showing a degree of public spirit that ought to obtain throughout the county. If there was a deputy game warden in every community with authority to make arrest in cases of this kind, the man power and the moral sense of right would be forthcoming.  On Friday, October 31st, a party of hound hunting deer killers, belonging largely on Guemes and Sinclair islands, arrived in a sloop at the Point Lawrence wharf. Their arrival was witnessed by a number of people, and the sloop was found to contain two deer carcasses. An attempt to obtain the names of the party, was met by evasion and denial; but next day the identity of several of them became known in other ways. The men went into camp on G. N. Culver's land, without permission, and made several trips into the interior of the island, presumably to practice their favorite game-destroying methods of hunting with hounds. On Sunday morning many of the residents of Doe Bay and Point Lawrence assembled for the purpose of arresting the party, or some of them, and confiscating their hounds. It was reported that Deputy-Sheriff Berne had been notified and would be out on the steamer. Meanwhile the violators of the game law were on their guard and it did not seem safe to take extreme measures until the legal officer was at hand, although a duly commissioned constable, Alv Soderbom, was in the neighborhood. So they 'put off till tomorrow' the thing that should but could not be 'done today'; that is, it seemed impossible then, but later in the evening one of the party, Al Granger, fell into a trap that nobody had set for him. He came to the back door of G. N. Culver's residence, accompanied by Harry Bridge, both carrying guns. The objected to entering the house but asked for Mr. Culver, who went to the door. Granger then demanded to know if he (Culver) had been down to the wharf and had seen two deer carcasses there. Mr Culver told him that he had seen both a buck and a doe there. Granger than insolently and angrily accused Mr. Culver of stealing them and threatened to have him arrested if he did not produce them. Officer Soderbom chanced to be within hearing and after considerable resistance and with the aid of Fred Schmidle, who was also present by mere chance, Granger was 'gathered in' for the night, waiting for transportation to Olga the next day where opportunity was afforded him for a hearing before Justice of the Peace Chaffee.\n\n1903\n\nJuly\n\nMr. Craft's trap is getting quite a lot of sockeyes.\n\nNovember\n\nIn laying out the course of its proposed cables to this county, The Independent Telephone Company, of Whatcom county, at first contemplated using Lummi island as a stepping stone to Point Lawrence, Orcas island, thence to San Juan, and on via South Fidalgo to the Sunset system at Anacortes. In making a survey of this route, however, an obstacle has been encountered which may necessitate a change of route. Off Point Lawrence there is said to be a great abyss in the sea bottom six fathoms in depth, across which, on account of the heavy tides, it is considered unsafe to lay a cable because of constant danger of breakage. The general character of the bottom between Point Lawrence and Lummi island is said to vary much from that indicated by the government charts and to be unfavorable for a cable route. The bottom is reported to be very rough and rock and the water much deeper than the charts indicate. Mr. Lain has been engaged this week in making a survey between Fidalgo and Decatur islands, with a view of connecting with the Sunset system at Anacortes instead of Whatcom. A little less cable would be required than via Lummi island and the practicability of the route was demonstrated many years ago when a cable was laid by the Western Union Telegraph Company.\n\n1904\n\nMay\n\nThere is some talk of Blaine parties driving the Craft trap at Point Lawrence.\n\n1905\n\nMay\n\nMr. Hansen came over from Bellingham Monday to superintend the work on the Craft-Hansen trap at Point Lawrence.\n\nOctober\n\nThe advertisements that Alderbrook farm was for lease brought twenty-five responses, indicating pretty conclusively that there are many people on the lookout for such changes. Mr. Culver has about concluded a lease to Mr. Sparks, of Van Buren, Whatcom county, who is expected at Alderbrook with his family next week.\n\nMr. and Mrs. Geo. McMillan, of Bow, Skagit county, were guests of G. N. Culver, Wednesday and Thursday. They came over to see Mr. Culver about leasing Alderbrook farm, Mr. Sparks, who was reported last week as having leased it, having changed his mind about coming.\n\n1906\n\nJanuary\n\nA new sheep shed is about complete at Alderbrook farm.\n\nMarch\n\nThe steamer Islander met with what might have been a very serious mishap last Saturday evening. A few minutes after leaving Doe Bay and when only a short distance off the Peapod rocks, in Rosario strait, her rudder unshipped ant it became impossible to steer her. The tidal current was running quite heavily and there was apprehension that she might drift upon the rocks. After some hazardous maneuvering the steamer was brought around with her bow toward the beach at Alderbrook farm and was run up on the sand. The passengers were taken ashore and drove across the island to the Harbor. Among them were four of the Doe Bay teachers—Misses Shull, Walker, Thompson and Smith—on their way home for the Easter vacation. After about an hour of hard work the rudder was reshipped and the steamer was run around to the Harbor. Later survey developed only slight damage, but after passing Point Lawrence and the small islands mentioned there was little danger. The steamer was put on the ways at Eliza island to have a new rudder shipped, and was back on her regular route Thursday.\n\nAugust\n\nMiss Dora Shull has returned to Alderbrook far, near Doe Bay, to spend a few weeks taking painting lessons from Mr. G. N. Culver.\n\n1907\n\nFebruary\n\nCounty-Surveyor Allen surveyed the old Estelle lime property, near Point Lawrence, Orcas island, a few days ago. It has been purchased by the Chuckanut Portland Cement Company.\n\nL. A. Blakeslee and family, who have been living on Alderbrook farm for the past year, moved back to Bellingham, Thursday.\n\nJuly\n\nLloyd Joubert spent most of the week at Alderbrook farm, near Doe Bay, picking cherries in the large orchard there and also doing a little haying.\n\nSeveral hundred pounds of magnificent Royal Ann cherries from Alderbrook farm, Orcas island, have been sold by the G. B. Driggs Company this week.\n\nNovember\n\nG. N. Culver made quite a large shipment of apples from Alderbrook Farm, Orcas island, to the cold storage at Bellingham, last week.\n\n1908\n\nJuly\n\nTwelve war vessels of the Pacific Fleet entered Rosario Strait at Point Lawrence at 5:30 a. m. last Tuesday morning and passed the Harbor in column formation about 11 o'clock, six miles east of Guemes island, up Bellingham channel. The last of the fleet passed out of sight at 12 o'clock.\n\nAugust\n\nMiss Dora Shull returned Tuesday evening from a week's stay with Mrs. G. N. Culver at Alderbrook farm, near Doe Bay. Miss Shuli is one of Mrs. Culver's most proficient art pupils.\n\nDecember\n\nEvery horticulturist should have a copy of the special apple edition of the Post-Intelligence, published last Sunday. It contained a large amount of interesting matter relative to the apple industry of the state and numerous illustrations of orchard scenes, including several in this country—the Howell orchard, on Decatur island, the Kepler orchard at Orcas and the orchards of Alderbrook farm, near Doe Bay.\n\n1909\n\nOn Tuesday John A. Doyle shipped a fine Oxford-down ram and three fine young pigs to G. N. Culver, at Alderbrook farm, near Doe Bay."
}
