{
  "slug": "1910s",
  "decade": "1910s",
  "extractedAt": "2026-01-15T21:48:00.000Z",
  "yearsIncluded": ["1910", "1911", "1912", "1913", "1914"],
  "rawContent": "1910\n\nJuly\n\nMisses Vivian Todd and Adeline Nelson are visiting for a few days with Misses Evelyn and Leda Culver at Mr. and Mrs. O. H. Culver's summer camp at Alderbrook farm, Orcas island.\n\n1911\n\nFebruary\n\nMr. and Mrs. S. J. Craft came over from Bellingham the first of the week for a short stay at their fine country home at \"Sea Acres.\"\n\nMarch\n\nKarl Minch went to Friday Harbor Tuesday to get medical advice about a sprained ankle. Mr. Minch has nearly closed a deal for working Alderbrook farm this season.\n\nG. N. Culver made a business trip to Friday Harbor Tuesday returning Wednesday, accompanied by Mrs. Culver, who had been visiting her two sons and their families the last three weeks.\n\nG. R. Emerging is pruning the orchard at Alderbrook Farm.\n\nMay\n\nG. N. Culver came from Friday Harbor last Saturday afternoon on C. Bruce Willis' launch, Rattletrap, to Woodside farm, where he stayed over night with the Willis family, going on to Alderbrook farm the following morning.\n\nMr. and Mrs. John J. Toomey and Mrs. M. O. Toomey, his mother, of Seattle, have been visitors at Alderbrook farm for several days. Mr. Toomey is thinking of renting Alderbrook farm. They all went away on Saturday morning.\n\nThe gas launch \"William Tell,\" of Seattle, was here this week with an apple buyer who bought several hundred boxes of apples. C. S. Willis, who is handling the fruit at Alderbrook farm, closed out his entire stock. The shipment takes about all the apples that remained unsold before.\n\nJune\n\nG. N. Culver went to Doe Bay yesterday to spend a few days at Alderbrook farm.\n\nJuly\n\nG. N. Culver went to Alderbrook farm the first of the week, taking with him a horse purchased here for farm use.\n\nAugust\n\nGeo. Nelson, who has been working for Mr. Roehl this summer, has accepted a like position with Mr. Culver at Alderbrook farm.\n\nSeptember\n\nMrs. G. N. Culver, who several months ago fell and broker her hip and who has since been at the home of her son, O. H. Culver, left Tuesday for her home at Alderbrook farm, Doe Bay.\n\nDecember\n\nG. N. Culver is at Doe Bay this week arranging for the leasing of Alderbrook farm, for next season.\n\n1912\n\nFebruary\n\nMrs. G. N. Culver broke her right hip last Wednesday at the home of her son, O. H. Culver. While the fracture is necessarily a painful one, Mrs. Culver stood the trip from her house to the hospital without suffering greatly. She is now in the hands of Dr. J. D. Ross who will do what his skill can do to make her comfortable.\n\nMay\n\nMrs. G. N. Culver left Wednesday for Alderbrook farm, Doe Bay, where she will spend the summer with her daughter and husband, Mr. Culver.\n\nSeptember\n\nMrs. G. N. Culver, of Alderbrook farm, Orcas island, fell down stairs a few days ago, severely spraining her good leg, the other, which she broke some months ago, being still in plaster. Mrs. Culver is now at the home of her son, O. H. Culver, where she will be cared for until sufficiently recovered to be about again.\n\n1913\n\nOctober\n\nG. N. Culver of Alderbrook farm made a shipment of King apples to Seattle on Monday that will make the east of the mountain growers hustle to beat.\n\n1914\n\nApril\n\nMrs. G. N. Culver, who had the great misfortune to break her left hip at Alderbrook farm, Orcas Island, April 4th., is reported to be getting along as nicely as could be expected at the home of her son here. It is the second time within a little over two years that she has had to endure the same trying ordeal, having broken her right hip Jan. 31, 1912, when visiting her son and family here."
}
