{
  "slug": "alderbrook-farm",
  "name": "Alderbrook Farm",
  "extractedAt": "2026-01-15T20:55:00.000Z",
  "images": [
    {
      "url": "https://lh3.googleusercontent.com/sitesv/AAzXCkeZ5TENTKnYA-BdhU6PTMHNneccM-X1i6otDmyx0NHUT-9Pehzf_QsCP14tcCBqANRtCs-YxAQ-vdgrixkoQUtUl4OUd9t8jzt0RkPHcyyKOYqsWPZvOBcnEyCZ0KXVDLpJ5bfADJwewdgwpeHaDRghZweOmtx9tskJF7P5kMAHG8yR6_ascHKDqkgKm5nXmFNOZhZa7gqXfk81zGN6fqTB4Cua8p7y2BEnTTA=w1280",
      "caption": "Source: Image #0122"
    }
  ],
  "about": "According to records O.H. Culver leased and later purchased a large amount of land here for a \"gentlemen's farm\" in order to raise fruits commercially before the advent of irrigation in Eastern Washington. The site was picked because it contained the most easterly location for a steamboat landing in a well sheltered cove. OH Culver built the home in 1889 with the help of his father George Nelson Culver and numerous hired help. G.N. ran the farm until 1914 when a farming injury forced him to leave and spend the rest of his days in Friday Harbor at the home of his son OH Culver. George and his wife Diana planted extensive orchards of apples, cherries, and Italian plumbs. In addition they raised animals including cattle and oxford down sheep. The farmhouse remains to this day in its original form with no indoor plumbing or electricity. It is now a designated State Historic Site. All other buildings slowly deteriorated and collapsed over time. The last to go was the big hay barn seen to the left of the Farmhouse. When it finally collapsed I salvaged several of the weathered cedar 1x12 barn siding boards which later became an interior wall of the Culver Family cabin at Pt. Lawrence.\n\nThe \"farmhouse\" as it was called now remains in the ownership of heirs of the Mary Culver Hall and Leda Culver Hipkoe families and still hosts occasional family gatherings during the warmer summer months. During the 40's and early 50's it was busy with various Culver families, particularly on weekends. My recollection is that Helge and Florian Johanson frequently stayed there, with lesser use by the Hipkoes and Halls. As a young boy I loved to walk up the road from Pt. Lawrence, cross the little stone dam across Alderbrook Creek at the rocky corner, and stay to visit. It always seemed like every one was always laughing and enjoying each others company. I learned to make black berry pies from Aunt Florian who was a wonderful pie maker and very patient with me.\n\nSometime after the death of OH the various properties owned by OH and GN were divided up between their siblings. Carroll Culver inherited the Pt. Lawrence Property, the Friday Harbor lands were sold, the Johansons moved in with Mabel Culver on Ellis St. and inherited that home upon her death. I do not know the details of the division of the Alderbrook Farmhouse but I do know that the Johanson family was not included in that deal as they had joined with other families from Bellingham to purchase the properties now know as Shorewood Acres.\n\nHelge was a prime mover on purchasing that huge piece of property from a man named William Moultray which included all the waterfront from the Community Beach around to the bluff just east of Roehl's beach. Helge convinced several successful Bellingham business men to join him in the purchase, among them Ken Ireland (owner/founder Ireland and Bellingar Insurance), Victor Hughes (VP of Puget Sound Pulp and Timber which became Georgia Pacific), Dr. Ralph Sharninghouse (an osteopath), Max Hanson (grocery and meats), Arthur Boyd (General Mgr of the Sears and Roebuck store), Quentin Rochefort (who became CEO of Loomis Armored Car), The Kirkpatricks (owners of the Lynden Department Store) and Burt Kingsbury (a prominent lawyer). Despite this formidable group, the property was still too large for them to make a deal. Carroll Culver and Roy Bulman agreed to purchase several hundred remaining feet of waterfront and much of the back land which had been in pasture or remained wooded and quite hilly above the County road. Later, when Helge, Carroll and others were able to secure water rights to a portion of Mountain Lake the Doe Bay Water system was formed, and eventually storage tanks were built high up on the hill above Shorewood on land Carroll donated to the Doe Bay Water system.\n\nSource: Ken Culver",
  "keyDates": "TBD",
  "inTheNews": [
    {
      "date": "1895 July 18",
      "headline": "Fire at Alderbrook",
      "content": "The old Alderbrook farm house, near Doe Bay, Orcas island, belonging to G. N. And O. H. Culver, was entirely destroyed by fire shortly before noon last Thursday, with nearly all its contents. No one was in the house at the time and the fire was first discovered by Mrs. Culver's sister, from her home near by, but it was too late to do more than save the furniture from one room, all else was destroyed. The house was a one story structure, very dry and it burned like tinder. A strong wind was blowing and in fifteen or twenty minutes there was nothing but a heap of ashes and a few blackened timbers to indicate where the building had stood. Miss Culver saved most of her wearing apparel and personal effects but Mr. and Mrs. Culver were not so fortunate. The loss must amount to seven or eight hundred dollars and there was no insurance. Fortunately the wind was blowing away from the large new house under construction or that might have burned also."
    }
  ],
  "historicSiteInfo": {
    "title": "Alderbrook Farmhouse State Historic Site",
    "source": "National Register of Historic Places Inventory, Nomination Form. Gail Lee Dubrow, Assistant Professor of Architecture, October 1985",
    "description": "The Alderbrook Farmhouse is located on the east side of Orcas Island several miles northeast of Doe Bay in San Juan County. Sited near a 15 acre orchard, the house was once part of a fruit farm and stock ranch owned by the Culver family. Although most associated outbuildings (including barn, woodshed, prune dryer, and farm hands' house) no longer stand, the farmhouse itself retains nearly complete integrity and clearly reflects its period of construction. The house is characterized by an asymmetrical plan, intersecting gable roofs, decorative siding, and modest ornament typical of houses built in the late nineteenth century.\n\nThe two story frame house, which rests on a foundation of split granite blocks laid in regular courses, is composed of two principal intersecting wings with a secondary kitchen wing. Structural components are full dimension, rough sawn fir. Exterior walls are sided with pattern-sawn shingles on the upper story and clapboard siding on the lower story. The eaves are underscored with frieze boards and trim boards articulate the corners. The roof is sided with cedar shingles.\n\nOn the west elevation, the house is dominated by the east-west gable which projects over a livingroom bay. The same elevation features a recessed entry porch in the perpendicular (north-south) wing. The porch is sheltered by the slope of the gable roof and is supported by chamfered posts and features a balustrade and frieze ornamented with lattice stickwork. On the south elevation, the two story north-south gable wing projects beyond the east-west wing, which in turn features a gabled dormer and a two story porch with chamfered posts and lattice work balustrade and frieze. On the east elevation, the gable roof kitchen wing (with attached shed) projects perpendicularly from the main house.\n\nAcross all elevations, windows are one-over-one double-hung sash with prominent moulded drip-caps. The front door has an upper glazed panel of clear glass surrounded by a fixed pane of colored glass. Two brick chimneys with corbelled caps rise from the roofline.\n\nThe front door opens on a small hallway from which one can access the living room, dining room, downstairs bedroom and staircase. The plan is compact and efficient with little space devoted solely to passageways. All rooms can be closed off so heated areas may fluctuate with seasonal weather. Heating is supplied by the kitchen stove, wood stoves in the dining room and upper north bedroom, and fireplace, as was the case originally.\n\nInterior walls are plaster trimmed with wood corner rounds, picture rails and 12 inch baseboards. All doors are paneled and doors and windows are framed by eight inch fluted casings with turret corners. The fireplace and hearth are faced with six by six inch glazed tile and surmounted by a wood cornice-shaped mantle. The south porches are accessed through doors from the south downstairs and upstairs bedrooms. The nominated property includes the house and 3.2 acres of the surrounding site. The historic orchard is not included in its entirety because it no longer reflects its original character. A rectangular, frame barn with gable roof and board and batten siding, is located about 30 feet northeast of the house on the nominated property. A pump, of uncertain age, is located about 30 feet west of the west elevation.",
    "statementOfSignificance": "The Alderbrook Farmhouse is a significant example of late nineteenth century residential architecture in San Juan County and stands as one of the few perfectly preserved reminders of the prosperous years of San Juan County's agricultural economy. It remains on its original site and has been maintained unaltered by the Culver heirs. It has never been plumbed, wired, or centrally heated.\n\n\"Alderbrook\" was built for George N. Culver by his son, Otis H. Culver. Both were from Vermont. Otis, who while he was in Bellingham that he became interested in the San Juan Islands and leased 500 acres of state land at Point Lawrence on Orcas Island. His selection of the Point Lawrence property was largely based on convenience. It was near Doe Bay, the first stop for the steamers from Bellingham carrying passengers, cargo, and mail to the islands. Having acquired the land, he encouraged his father and mother to come west and settle on the property. Near the present site of the house they cleared 15 acres for a fruit orchard. Portions of the remaining acreage that were suitable, they devoted to pasture for raising cattle and Oxford Down sheep. The house was built at the height of a depression. All materials were barged from Bellingham, beached at Point Lawrence, and carried to the site by horse drawn wagon. The builders lived on the site during construction. They were paid $1 per day plus board. G.N. Culver ran Alderbrook as a working farm until 1914, when he retired as a result of an injury.\n\nOtis Culver, who retained ownership of the property, became head of the Tacoma Bureau of the Seattle Post-Intelligencer. In 1894, John S. McMillian of the Tacoma and Roche Harbor Lime Company, encouraged Otis to move to Friday Harbor on San Juan Island and purchase the Islander, one of the first two newspapers in the San Juan Islands. In 1897, Otis was named Deputy Collector of the U.S. Customs Service in charge of entry at Roche Harbor and later at Friday Harbor. Otis Culvers' political editorializing in the Islander and his dealings with the smuggler, James \"Pig Iron\" Kelly as customs officer, contributed to the most colorful era in San Juan County history.\n\nThough unpretentious, Alderbrook is a notable landmark on Orcas Island, distinguished by its irregular roofline, decorative siding, simple ornament, and state of preservation. Historic photographs illustrate that the original appearance is virtually intact. This continuing integrity is especially notable in a county where changing land use has left few remnants from the area's agricultural heritage. Recent survey work in the county reveals that Alderbrook stands in sharp contrast to other residences of the period that have been disfigured or deteriorated. As such, it is an important illustration of the building traditions of settlers in the San Juan Islands at the turn of the century.\n\nAlderbrook Farm itself comprised a small part of the Culver holdings at Point Lawrence. This circa 1910 photograph shows the 15-acre apple and prune orchard that surrounded the house. Additional acreage was given over to raising cattle and Oxford down sheep. Alderbrook remained a working farm until 1915. In the distance are Sinclair, Guemes, and Cypress Islands\n\nSource: Doe Bay Historical Images and Favorite Recipes"
  },
  "questionsToAnswer": "None at this time"
}
