{
  "slug": "doe-bay",
  "name": "Doe Bay Store",
  "extractedAt": "2026-01-15T21:02:00.000Z",
  "images": [],
  "memories": {
    "author": "Ken Culver",
    "content": "The Doe Bay Store was the center of activity for several reasons. It had a well stocked store, a post office, sold gas, and was adjacent to the Doe Bay Community Dock where the Mailboat Osage stopped daily. The store was in front and in the back overlooking Doe Bay was a pub with tables and booths lined around the outside edge. In my lifetime this never operated, instead serving as a place for local kids to shoot baskets when the weather was inclement. The room was large enough to serve as a gathering place for pot lucks and square dancing. Our whole family would go for the potluck and then the dancing would start, and the kids would all tear around outside until they were tired out. We would sleep in the old station wagon until the dance was over. Culver Willis was often the square dance caller and I can hear him call out \"allamende left\" which meant you faced your neighbor to the left, circled around them, and then rejoined your partner and dropped your hands.\n\nThere was no rural delivery at that time, so everyone had a P.O.Box, with a little frosted glass door and combination to open it. Perhaps someone has photos of the inside of the store which was laden with items - essentially a small general store. I distinctly remember a large \"cheese wheel\" covered with cheese cloth. You ordered a slice, which was cut off using a cheese knife that rotated on the wheel prior to weighing it and wrapping it in white butcher paper. That cheese (to my knowledge) was not refrigerated.\n\nIn the summer my Dad would drive the '41 Ford pickup down to pick up block ice carried from Bellingham on the Osage. It came in huge 300 pound blocks wrapped in burlap and was divided up on the dock using an ice pick. Properly done, ice cracks into straight lines, and was usually broken up into 25 lb. blocks which fit the small ice boxes of the time. At Pt. Lawrence Lodge you ordered your ice the night before and it was called in to the Bellingham Ice Company who then delivered it to the Osage at Bellingham.\n\nThe same was true of many supplies. Carroll had a Morse Hardware Catalog and called in to order often. Next day it was on the Osage."
  },
  "questionsToAnswer": ""
}
