{
  "slug": "olga-cemetery",
  "name": "Olga Cemetery",
  "extractedAt": "2026-01-15T21:24:00.000Z",
  "images": [],
  "memories": [
    {
      "author": "Jane Barfoot Hodde",
      "source": "\"125 Years: Olga: Memories and Potlucks\" (Compiled by Irene Barfoot O'Neill) - Copied from a letter from Jane Barfoot to the Olga Community Club, circa November 1991",
      "content": "Olga Cemetery was established in the early 1890s on property donated by William and Sarah Moore. This 210-foot square was a reasonably open area on the upper part of the Moore homestead, but there were many large trees that were taken out through the years. Prior to 1900 there had been less than ten burials recorded.\n\nRichard C. Willis (my grandfather) platted the cemetery, with the plat having been recorded May 4, 1906 in Friday Harbor. The deed (which was for many years kept with the Community Club secretary's books but which was such an interesting document that \"someone\" caused it to \"disappear\") was dated earlier than the plat and stated that the cemetery was dedicated to the community for free burial regardless of race, creed, or color. Unfortunately, I did not make a copy of the deed as I have of other old documents. Since that time the various legal aspects of the operation have been a matter of contention more than once. The entire area is divided into one-foot squares, to record location of lots and burials.\n\nThe Olga Ladies Aid was in charge of cemetery upkeep for many years. For years after my parents, Cecil and Louise Willis, came here in 1924 the women set aside a certain amount of money each year for the cemetery and hired someone to do the work. In 1943 the weeds, grass, and brush needed to be cut; the area was in very bad condition at that time (illegible) and a date was set for a work party with the women furnishing the dinner. Thus was started the tradition of the \"Cemetery Picnic\", a highlight of the year when the entire community would meet on a date set near Decoration Day—entire families working together, then at noon a long table in the alder grove below the cemetery was spread with all kinds of good food and a general feeling of fellowship. Other ways Olga has been indeed as a community were several summer picnics on Carlson's beach, and the annual Thanksgiving dinner in the old dance hall—a picture in in the display cabinet in the corner of the Energetic Club House. The lady sitting on the platform with the musicians is the only known photo of Sarah Moore, according to her granddaughter, Marjorie Reed Klingman, of Anacortes, whose mother was Ella Moore, younger child of William and Sarah. Another sidelight of these gatherings was the fact that we all sang hymns, songs, etc. In the early 1950's seventy people were present for dinner and a meeting at the Club House, after working all morning in the cemetery. Mrs. George (Ethel) Loomis was presiding officer. A mower was purchased for anyone to use, providing their own gas.\n\nWhen the Community Club was organized in 1958-59, the ladies asked them to take over the supervision of the cemetery. In 1967 the State Department of Game furnished wire for fencing in a special program when damage from deer was widespread. Fence posts were donated; the Club bough gates and Burial Hall was hired (mostly donated) to complete the fence in 1962. Thurman and Joe Bond took over from Bill Moore as coordinator of grave location and work. Glen Rodenberger and Murl Johnson replaced old lot markers that had been broken or were nonexistent. There were many unmarked graves. Ralph Pinneo cemented the first fifty markers that were purchased by the cemetery funds and others have been added.\n\nAll work at the cemetery through the years has been voluntary, giving the community a rare privilege in these times of being able to work together and give to our neighbors and friends the same feeling we ourselves would wish.\n\nBill Moore kept records, mostly in his head, of most of the early burials; Mr. Loomis started a book of the locations, which is still being used. My mother, Louise Willis, was Sexton, or record keeper, from 1937 to 1954, when she turned it over to me. It was very important that these records be kept up to date, as many people come seeking information of their forebears. Also state laws say all burials must be recorded.\n\nAll funds must be kept for maintenance and expanse as the monies have been given specifically for that purpose.\n\nI would urge anyone in the Olga/Doe Bay Area who feel they might wish to be buried here to reserve a space, so that when the time comes there is not the stress of choosing."
    }
  ]
}
