{
  "slug": "the-san-juan-islander",
  "name": "The San Juan Islander",
  "extractedAt": "2026-01-15T21:30:00.000Z",
  "images": [],
  "subtitle": "Islander and San Juan Islander: 1891-1914",
  "about": "The Islander was first published by James Cooper Wheeler on March 6, 1891, in Friday Harbor, Washington. Friday Harbor is located on San Juan Island in the Puget Sound about halfway between Bellingham, Washington, and Victoria, British Columbia. The paper included news from nearby Orcas and Lopez Islands. The inhabitants of the region were mostly fishermen and farmers, and much of the paper was devoted to news of farmers' cooperatives, commodity prices, new agricultural production methods, and the movements of shipping vessels. The San Juan Islands also produced lime for concrete, and their striking beauty encouraged tourism.\n\nIt was common for rural newspapers in this period to experience delays in production due to the difficulty of moving equipment to remote locations, and the Islander was no exception. Wheeler planned to produce the first issue of the paper on November 28, 1890, but it did not appear until March 6, 1891. Wheeler soon sold the paper to F.N. Paxson, who ran the paper from July 1894 to June 1895. He was a member of the Populist Party, and though the paper never took a strong political tone, Paxson was quite critical of the extremism and violence of certain labor organizations in his editorials and also criticized his opponents' attempts to depict themselves as more \"patriotic\" than the Populists. After selling the paper, Paxson traveled to Alaska during the Klondike gold rush and contributed a series of letters about his prospecting adventures to the Islander.\n\nOtis H. Culver and his brother Fred Culver bought the Islander in 1896. O.H. Culver had worked on a newspaper in northern Idaho in 1884-89 and succeeded William Lightfoot Visscher as editor at the Fairhaven Herald in 1890. He had also managed the Bellingham Herald for two years. In the first issue of the Islander they published, the Culver brothers declared their membership in the Republican Party. In 1898, the name of the paper was changed to the San Juan Islander. O. H. Culver also became a customs official in 1897, managing the port in Roche Harbor for three years before establishing the port at Friday Harbor, where he remained customs official until 1920.\n\nO.H. Culver left the San Juan Islander in 1909. Fred Culver and the \"Islander Company Publishers\" continued to manage the paper until April 1913 when Fred Culver's widow sold it to John N. Dickie of Seattle. The San Juan Islander ceased publication in 1914.",
  "source": "https://chroniclingamerica.loc.gov/lccn/sn88085190/",
  "providedBy": "Washington State Library; Olympia, WA"
}
